[
{"artist": "Taylor Swift", "artist_link": "https://itunes.apple.com/us/artist/taylor-swift/id159260351?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is3-ssl.mzstatic.com/image/thumb/Features118/v4/2d/70/92/2d70928c-4432-5de7-af20-ac258f22f5c8/source/735x135sr.jpg", "origin": "Wyomissing, PA", "genre": "Pop", "born": "Dec 13, 1989", "latest_release": "Call It What You Want - Single", "intro": "Taylor Swift is that rarest of pop phenomena: a superstar who managed to completely cross over from country to the mainstream. Other singers performed similar moves -- notably, Dolly Parton and Willie Nelson both became enduring mainstream icons based on their '70s work -- but Swift shed her country roots like they were a second skin; it was a necessary molting to reveal she was perhaps the sharpest, savviest populist singer/songwriter of her generation, one who could harness the Zeitgeist and turn it personal and, just as impressively, perform the reverse. These skills were evident on her earliest hits, especially the neo-tribute \"Tim McGraw,\" but her second album, 2008's Fearless, showcased a songwriter discovering who she was and, in the process, finding a mass audience. Fearless wound up having considerable legs not only in the U.S., where it racked up six platinum singles on the strength of the Top Ten hits \"Love Story\" and \"You Belong with Me,\" but throughout the world, performing particularly well in the U.K., Canada, and Australia. Speak Now, delivered almost two years later in the autumn of 2010, consolidated that success and Swift moved into the stratosphere of superstardom, with her popularity only increasing on 2012's Red and 2014's 1989, a pair of records that found her moving assuredly from country into a pop realm where she already belonged.This sense of confidence had been apparent in Taylor Swift since the beginning. The daughter of two bankers -- her father, Scott Kingsley Swift, worked at Merrill Lynch; her mother Andrea spent time as a mutual fund marketing executive -- Swift was born in Reading, Pennsylvania and raised in suburban Wyomissing. She began to show interest in music at the age of nine, and Shania Twain wound up as her biggest formative influence. Swift started to work regularly at local talent contests, eventually winning a chance to open for Charlie Daniels. Soon, she learned how to play guitar and began writing songs, signing a music management deal with Dan Dymtrow; her family relocated to Nashville with the intent of furthering her music career. She was just 14 years old but on the radar of the music industry, signing a development deal with RCA Records in 2004. Swift sharpened her skills with a variety of professional songwriters, forming the strongest connections with Liz Rose. Taylor's original songs earned her a deal with Sony/ATV Music Publishing, but not long after that 2004 deal she parted ways with Dymtrow and RCA, all with the intent of launching her recording career now, not later. Things started moving swiftly once Swift came to the attention of Scott Borchetta, a former DreamWorks Records exec about to launch Big Machine Records. Borchetta saw Swift perform at a songwriters showcase at the Bluebird Cafe and he signed her to Big Machine in 2005; shortly afterward, she started work on her debut with producer Nathan Chapman, who'd previously helmed demos for Taylor. Boasting original song credits on every one of the record's 11 songs (she penned three on her own), Taylor Swift appeared in October 2006 to strong reviews and Swift made sure to work the album hard, appearing at every radio or television event offered and marshaling a burgeoning fan base through use of MySpace. \"Tim McGraw,\" the first song from the album, did well but \"Teardrops on My Guitar\" and \"Our Song\" did better on both the pop and country charts, where she racked up five consecutive Top Ten singles. Other successes followed in the wake of the debut -- a Grammy nomination for Best New Artist (she lost to Amy Winehouse), stopgap EPs of Christmas songs -- but Swift concentrated on delivering her sophomore set, Fearless.Appearing in November 2008, Fearless was certified gold by the RIAA in its first week of release, and the record gained momentum throughout 2009, earning several platinum certifications as \"Love Story,\" \"White Horse,\" \"You Belong with Me,\" \"Fifteen,\" and \"Fearless\" all scaled the upper reaches of the country charts while \"You Belong with Me\" nearly topped Billboard's Top 100. Along with the success came some headlines, first in the form of an infamous appearance at the 2009 MTV Video Music Awards where her acceptance speech was interrupted by Kanye West, who burst on-stage to declare that Swift's rival Beyoncé deserved the award more, but her romances also started gaining attention, notably a liaison with Twilight star Taylor Lautner, who appeared with the singer in the 2009 film Valentine's Day. Her flirtation with the silver screen proved brief, as she then poured herself into her third album, Speak Now. Released in October 2010, Speak Now was another massive first-week smash that refused to lose momentum. Hit singles like \"Mine\" and \"Mean,\" which won two Grammys, played a big factor in its success not just on the country charts but on pop radio as well. Following a 2011 live album called World Tour Live: Speak Now, Swift turned toward following a pop path on her fourth album, hiring such mainstream musicians as Dan Wilson, Butch Walker, and Britney Spears producer Max Martin. This mainstream pulse was evident on \"We Are Never Ever Getting Back Together,\" the first single from Red. Upon its October 2012 release, Red shattered expectations by selling over a million copies in its first week, a notable achievement that was doubly impressive in an era of declining sales. Once again, Swift's album had legs: it was certified platinum four times in the U.S. and its international sales outstripped those of Speak Now. She supported Red with an international tour in 2013 and more hits came, including \"I Knew You Were Trouble\" and \"22.\"As Swift geared up for the release of her fifth album in 2014, she made it clear that 1989 was designed as her first \"documented, official\" pop album and that there would be no country marketing push for the record. \"Shake It Off,\" an ebullient dance-pop throwback, hit number one upon its August 2014 release. When 1989 appeared in late October 2014, it once again shot to number one and became her third straight album to sell one million copies in its first week (a new record for any artist).Swift gathered many awards during the subsequent year, including Billboard's Woman of the Year, the Award for Excellence at the American Music Awards, and a special 50th Anniversary Milestone Award from the CMAs. Her 1989 World Tour crossed Asia, North America, and Europe during the last half of 2015, and she won three Grammy Awards at the 2016 ceremonies, including Album of the Year, Best Pop Vocal Album, and Best Music Video for \"Bad Blood.\" At the end of 2016, she released \"I Don't Wanna Live Forever,\" a duet with ZAYN from the soundtrack for Fifty Shades Darker. The single reached the Top Five across the world. Swift returned with her sixth album, Reputation, in November 2017, preceded by the August single \"Look What You Made Me Do\" and its September successor, \"...Ready for It?\" ~ Stephen Thomas Erlewine"},
{"artist": "Brett Young", "artist_link": "https://itunes.apple.com/us/artist/brett-young/id1084576956?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music42/v4/6d/5e/db/6d5edbba-cdb4-5720-261d-f3d2aa83a035/source/146x146sr.jpg", "origin": "", "genre": "Country", "born": "", "latest_release": "O Holy Night - Single", "intro": "A singer and songwriter whose music balances the sophistication of contemporary pop with the emotional palette of modern country, Brett Young was born and raised in Orange County, California, and was a teenager when he first developed a love for music by learning to play guitar. In the late '90s, Young was a student at Costa Mesa's Calvary Chapel High School, and he volunteered to help the school's worship leader with performances on Friday mornings. One Friday, the music leader was out of town, and Young ended up taking his place. The experience convinced Young he had what it took to perform in front of an audience, but even as his confidence grew, his first loyalty was to sports. Young was a star pitcher on Calvary Chapel High's baseball team, and in his senior year he helped the team achieve a 28-1 record and took them to the CIF championships, chalking up 130 strikeouts and a 0.90 ERA that season. Young was being scouted by the majors during his high-school days, but his baseball career came to an end in college when a serious elbow injury spoiled his pitching arm, and he began exploring music again. Influenced by Gavin DeGraw, Young began writing songs and making use of his rich, soulful voice. By 2007, he was appearing regularly at California listening rooms, and he'd released his first record, a self-titled EP. In 2011, Young released a second independent effort, Make Believe, and On Fire followed in 2013. After Young's first decade in the business, he'd appeared at some of California's most prestigious venues, including the Troubadour, the Roxy, and the Viper Room, and had opened for the likes of Colbie Caillat and Katy Perry. As Young began bringing forward the country-influenced side of his music and songs, he left California for Nashville, Tennessee and celebrated the move with an EP titled Country in California. Young's new sounds attracted the attention of the powerful Nashville-based label Big Machine Label Group, which signed him to a record deal. Young's debut for the label, a six-song EP titled Brett Young, was released in February 2016. His single \"Sleep Without You\" fared well on both the country and pop charts, reaching number 81 on the Billboard Hot 100. Another hit, \"In Case You Didn't Know,\" followed before the release of his eponymous Big Machine debut in February 2017. ~ Mark Deming"},
{"artist": "Led Zeppelin", "artist_link": "https://itunes.apple.com/us/artist/led-zeppelin/id994656?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Features7/v4/02/ae/d4/02aed479-26f5-30a6-e779-794b7b44865d/source/735x135sr.jpg", "origin": "England", "genre": "Rock", "born": "Jul 1968", "latest_release": "\n      ", "intro": "What the Beatles were to the '60s, Led Zeppelin were to the '70s: a band so successful and innovative they wound up creating the prism through which their entire epoch was seen. Zeppelin ushered in the era of album rock -- they refused to release singles off their albums, even when they were garnering massive radio play -- and of arena rock, playing ever-larger stadiums as their ticket sales skyrocketed. Other bands played on a similar field but Led Zeppelin carried a unique mystique cultivated by cryptic album art, distance from the press, and, of course, their music. Drawing upon postwar electric blues, early rock & roll, and psychedelia, Zeppelin created a titanic roar in their earliest days but even then they weren't merely heavy. Underneath the wattage, there was a strong undercurrent of folk-rock and the quartet would soon thread in world music, funk, country, and synthesizers, creating an adventurous body of work that had a long, lasting influence on hard rock, heavy metal, and alternative rock.Quite a feat for a band whose origins lie in the ashes of the pioneering British rock band the Yardbirds. Jimmy Page, a guitarist who made his reputation as a session man in the '60s, joined the band in 1966, functioning as the replacement for bassist Paul Samwell-Smith, but he soon split lead guitar duties with Jeff Beck and took over that position entirely once Beck departed. Page contributed heavily to the band's final album, 1967's Little Games, which also saw contributions from John Paul Jones, a bassist and string arranger who also ran in the same studio circles as Page; the two played on Beck's 1966 single \"Beck's Bolero,\" which also featured Keith Moon. Under the direction of their new manager Peter Grant, the Yardbirds supported the album with a tour of the United States, but the group was in its final days. Just before the band's dissolution, Page filled the time with session work, including a spring 1968 session where he played on Jones' arrangement of Donovan's \"Hurdy Gurdy Man.\" During the sessions, Jones requested to be part of any future project of Page's. This future project materialized quickly. In the summer of 1968, the Yardbirds' Keith Relf and James McCarty left the band, leaving Page and bassist Chris Dreja with the rights to the name, along with the obligation of fulfilling an upcoming fall tour. Page set out to find a replacement vocalist and drummer. Initially, he wanted to enlist singer Terry Reid and Procol Harum's drummer B.J. Wilson, but neither musician was able to join the group. Reid suggested that Page contact Robert Plant, who was singing with a band called Hobbstweedle.After hearing him sing, Page asked Plant to join the band in August of 1968, the same month Chris Dreja dropped out of the new project. Following Dreja's departure, John Paul Jones joined the group as its bassist. Plant recommended that Page hire John Bonham, the drummer for Plant's old band, the Band of Joy. Bonham had to be persuaded to join the group, as he was being courted by other artists who offered the drummer considerably more money. By September, Bonham agreed to join the band. Performing under the name the New Yardbirds, the band fulfilled the Yardbirds' previously booked Scandinavian engagements in late September 1968. The following month, they recorded their debut album in just under 30 hours. Also in October, Dreja informed Page he had the rights to the New Yardbirds name for the live dates only, so the group switched its name to Led Zeppelin. Grant helped the band sign a record-setting contract with Atlantic Records in the United States before the end of the year; they were paid a reported $200,000 advance, at that date the largest sum for any new band. Early in 1969, Led Zeppelin set out on their first American tour, which helped set the stage for the January release of their eponymous debut album. Two months after its release, Led Zeppelin had climbed into the U.S. Top Ten. Throughout 1969, the band toured relentlessly, playing dates in America and England. While they were on the road, they recorded their second album, Led Zeppelin II, and that speed gave the record's loud, riff-heavy blues a palpable urgency.Like its predecessor, Led Zeppelin II was an immediate hit upon its October 1969 release, topping the American charts two months after its release and spending seven weeks at number one. The album helped establish Led Zeppelin as an international concert attraction, and for the next year, the group continued to tour relentlessly. Led Zeppelin started to broaden their horizons with Led Zeppelin III. Recorded in a cottage in Wales and released in October of 1970, the album saw them weaving British folk into their heavy rock, a hybrid that deepened the band's sound. Led Zeppelin III reached number one in both the U.K. and U.S. but, comparatively, sales were softer for this record than the two previous blockbusters; it never earned a platinum certification in the U.K. but, over the years, it went platinum six times in the U.S., a sign of its reputation as one of band's most distinctive records. Despite Zeppelin's stated aversion to singles, they did support III with the release of \"Immigrant Song\" as a 7\" in the States, backed with the non-LP \"Hey, Hey What Can I Do,\" their only B-side to not appear on an album. Led Zeppelin didn't tour as heavily behind Led Zeppelin III as they did Led Zeppelin II, but they were well on their way to consolidating their status as one of the most popular attractions in rock. Their next record, an untitled record commonly referred to as Led Zeppelin IV, cemented that reputation. Released in November 1971, Led Zeppelin IV merged the heavy blues of II with the folk mysticism of III and at the crossroads of those two extremes lay \"Stairway to Heaven,\" an eight-minute epic that encapsulated much of Zep's majesty. \"Stairway to Heaven\" was an immediate radio hit, eventually becoming the most played song in the history of album-oriented radio; the song was never released as a single. Despite the fact that the album never reached number one in America, Led Zeppelin IV was their biggest album ever, selling well over 37 million copies over the next four decades.Led Zeppelin supported Led Zeppelin IV with their biggest tour to date -- biggest according to size, not dates. All around the world they made the leap into stadiums and sports arenas, pioneering a circuit that became commonplace later in the decade, leaving legends of excess along the way. After completing their 1972 tour, they retreated from the spotlight and recorded their fifth album, Houses of the Holy. Appearing in March 1973, Houses of the Holy found them weaving in touches of funk and reggae amidst their crunching rock and seven-minute epics. Once again, Zeppelin had another smash album on their hands and its success led to an American tour that broke box-office records -- most of which were previously held by the Beatles. The band's tour culminated in a three-night stand at New York's Madison Square Garden in July 1973, a stint that was filmed and released as the concert film The Song Remains the Same in 1976. Following this record-breaking tour, Led Zeppelin spent a quiet year during 1974, releasing no new material and performing no concerts. They did, however, establish their own record label, Swan Song, which released all of Led Zeppelin's subsequent albums, as well as records by Dave Edmunds, Bad Company, the Pretty Things, and several other acts. Physical Graffiti, a double album released in February of 1975, was the band's first release on Swan Song. The album was an immediate success, topping the charts in both America and England. Led Zeppelin launched an international tour with a five-night stint at London's Earls Court but on the eve of the American leg that fall, Robert Plant and his wife suffered a serious car crash while vacationing in Greece. The tour was canceled and Plant spent the rest of the year recuperating from the accident.As Plant recovered, the band headed to Malibu to record a new album. The resulting Presence appeared in the spring of 1976 and while it debuted at number one in both the U.S. and U.K., sales lagged slightly, possibly due to the band's decision not to tour in support of the album. Instead, they released the film The Song Remains the Same, which appeared in the fall of 1976; its soundtrack peaked at number one in the U.K. and number two in the U.S. Zeppelin finally returned to the stage in the spring of 1977 with a tour of the United States (the U.K. was off limits, as the band decided to take a tax exile). The concerts raked in money but nearly three months into the tour, Plant's six-year-old son Karac died of a stomach infection. Led Zeppelin immediately canceled the tour and offered no word whether or not it would be rescheduled, causing widespread speculation about the band's future. For a while, it did appear that Led Zeppelin were finished. Robert Plant spent the latter half of 1977 and the better part of 1978 in seclusion. The group didn't begin work on a new album until late 1978, when they began recording at ABBA's Polar Studios in Sweden. A year later, the band played a short European tour, performing in Switzerland, Germany, Holland, Belgium, and Austria. In August of 1979, Led Zeppelin played two large concerts at Knebworth; the shows were their first English performances in four years and would be their last English concerts.In Through the Out Door, the band's much-delayed eighth studio album, was finally released in September of 1979. The album entered the charts at number one in both America and England. In May of 1980, Led Zeppelin embarked on their final European tour. In September, they began rehearsing at Jimmy Page's house in preparation for an American tour. On September 25, John Bonham was found dead in his bed -- following an all-day drinking binge, he had passed out and choked on his own vomit. In December of 1980, Led Zeppelin announced they were disbanding, since they could not continue without Bonham.Following the breakup, the remaining members all began solo careers. John Paul Jones returned to producing and arranging; for years, he remained in a behind-the-scenes capacity, waiting until 1999 to release his solo debut, Zooma. After recording the soundtrack for Death Wish II, Jimmy Page compiled the Zeppelin outtakes collection Coda, which was released at the end of 1982. That same year, Robert Plant began a solo career with Pictures at Eleven. In 1984, Plant and Page briefly reunited in the all-star oldies band the Honeydrippers. After recording one EP with the Honeydrippers, Plant returned to his solo career and Page formed the Firm with former Bad Company singer Paul Rodgers. In 1985, Led Zeppelin reunited to play Live Aid, supported by drummers Phil Collins and Tony Thompson, sparking off a flurry of reunion rumors; the reunion never materialized. In 1988, the band re-formed to play Atlantic's 25th anniversary concert, this time playing with John Bonham's son, Jason. During 1989, Page remastered the band's catalog for release on the 1990 box set Led Zeppelin. At the time, the four-disc set became the biggest-selling multi-disc box set of all time, which was followed up three years later by another box set, the mammoth ten-disc set The Complete Studio Recordings.In 1994, Page and Plant reunited to record a segment for MTV Unplugged, which was released as No Quarter in the fall of 1994. Although the album went platinum, the sales were disappointing considering the anticipation of a Zeppelin reunion. The following year, Page and Plant embarked on a successful international tour, which eventually led to an all-new studio recording in 1998, the Steve Albini-produced Walking into Clarksdale. Although it received some positive reviews, the album wasn't a massive hit -- it went gold only in America -- and Page and Plant ended their union shortly thereafter; Page went on to tour with the Black Crowes, while Plant resumed his solo career. Further Zeppelin archival releases saw the light of day in the late '90s, including 1997's stellar double-disc BBC Sessions, plus Zep's first official hits compilations -- 1999's Early Days: The Best Of, Vol. 1 and 2000's Latter Days: The Best Of, Vol. 2 -- and an acclaimed 2003 double-DVD set of live performances from 1969-1979. A full reunion of the surviving members of the band, with Jason Bonham filling in for his father on drums, took place in 2007 when the group played a historic concert at London's 02 in memory of Atlantic Records founder Ahmet Ertegun. The set was filmed and recorded, and finally appeared as a commercial release under the title Celebration Day in the fall of 2012.In 2014, Led Zeppelin launched a massive catalog campaign supervised by Jimmy Page, containing newly remastered versions of all their albums, available on CD, high-resolution downloads, and vinyl. Additionally, there were deluxe editions containing previously unreleased material from the vaults. The first round of reissues contained the band's first three albums and appeared in June 2014; the last round appeared in July 2015. The group also released The Complete BBC Sessions in 2016, an updated and expanded edition of their 1997 collection BBC Sessions. The compilation included eight previously unreleased recordings, among them a long-lost radio session featuring the tracks \"You Shook Me,\" \"Sunshine Woman,\" and \"I Can’t Quit You Baby.\" ~ Stephen Thomas Erlewine"},
{"artist": "Selena Gomez & Marshmello", "artist_link": "https://itunes.apple.com/us/artist/selena-gomez/id280215834?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Features7/v4/ec/3d/65/ec3d6557-ebee-2c7c-9643-2b113525a3cf/source/735x135sr.jpg", "origin": "Grand Prairie, TX", "genre": "Pop", "born": "Jul 22, 1992", "latest_release": "Wolves - Single", "intro": "Selena Gomez may have started her career as an actress starring in a Disney Channel series at the age of 15, but she soon showed that her musical talents were perhaps even stronger as she piled up hit singles and chart-topping albums. Born in 1992, she grew up in Texas and got her first break as a cast member on the kids' TV show Barney and Friends. Gomez landed minor roles in several other TV programs, but it was her affiliation with the Disney Channel -- who discovered her during a nationwide talent search in 2004 -- that officially jump-started her acting career. Guest appearances on The Suite Life of Zach and Cody and Hannah Montana paved the way for Gomez's own show, The Wizards of Waverly Place, which premiered in October 2007 and quickly became one of the network's most popular programs. Gomez began juggling her commitment to The Wizards of Waverly Place with additional projects, including movie roles and a burgeoning singing career. Gomez began branching out into pop music by recording songs for her own Disney projects. She sang the theme song for The Wizards of Waverly Place, recorded several other tunes for the the show's soundtrack, and performed on the soundtrack of the family film Another Cinderella Story. By 2009, she'd also assembled her own teen pop band, Selena Gomez & the Scene, and signed a contract with Hollywood Records. The band's full-length debut, Kiss & Tell, was released that year and went gold, as did its 2010 follow-up, A Year Without Rain. Gomez continued filming The Wizards of Waverly Place and made her theatrical debut in the 2010 film adaptation of Ramona and Beezus, but her music garnered just as much attention. When The Wizards of Waverly Place started airing its final season in November 2010, Gomez shifted her attention back to her band, whose third album, When the Sun Goes Down, was recorded in early 2011 and released later that year. She then took a break from music to focus more on acting, with her first role in a decidedly adult movie in 2013's Spring Breakers showing she could stretch beyond teen stardom. Her return to music in 2013 with her fourth album -- but the first credited to her as a solo artist -- also showed some stretching as she added dubstep, R&B, and EDM to her sound. Stars Dance was released in July of 2013 and debuted at number one on the Billboard 200. The rest of that year was a bit challenging for her, as she fired her management team and parted ways with Hollywood Records. She soon bounced back, though, and scored a deal with Interscope. One last Hollywood album, a contract-fulfilling hits collection titled For You, was released in late 2014 and featured the self-penned platinum single \"The Heart Wants What It Wants.\"In early 2015, Gomez guested on Zedd's hit EDM single \"I Want You to Know.\" On the heels of that success, she released her own single, the Sir Nolan- and Nick Monson-produced \"Good for You,\" which featured a guest appearance by the song's co-writer, rapper A$AP Rocky. The song featured on the 2015 album Revival, her first for Interscope. With production by Mattman & Robin, Hit-Boy, and Benny Blanco, among others, and songwriting credits for Charli XCX, Julia Michaels, and Chloe Angelides, the album had many collaborators. Gomez executive produced, though, and shared writing credits on six songs, making it her most personal effort to date. It entered the Billboard 200 at the top and spawned three number one singles on the Top 40 chart, making Gomez the sixth female artist to have at least three songs from the same album top the chart since 1992. ~ Matt Collar & Andrew Leahey"},
{"artist": "Liam Payne", "artist_link": "https://itunes.apple.com/us/artist/liam-payne/id366710817?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music127/v4/65/f0/99/65f099a2-f5b5-a982-3cf8-f1c7288119d7/source/146x146sr.jpg", "origin": "Wolverhampton, England", "genre": "Pop", "born": "Aug 29, 1993", "latest_release": "Bedroom Floor - Single", "intro": "Known for belonging to the internationally successful boy band One Direction, Liam Payne is an English singer/songwriter and pop artist. Hailing from Wolverhampton in the West Midlands of England, Payne was lauded for his eclectic vocal range and songwriting skills as one of the principal songwriters for the group. During the summer of 2014, he founded Hampton Music Limited, his own creative umbrella for future non-One Direction-related material. In May of 2017, Payne put out his first official single, \"Strip That Down,\" a slow-burning, midtempo trap- and R&B-inspired cut he co-wrote with Ed Sheeran and producer Steve Mac. ~ Rob Wacey"},
{"artist": "Kelsea Ballerini", "artist_link": "https://itunes.apple.com/us/artist/kelsea-ballerini/id382270241?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music19/v4/83/35/78/83357844-ab18-bb31-c418-39df174bd748/source/146x146sr.jpg", "origin": "Knoxville, TN", "genre": "Country", "born": "Sep 12, 1993", "latest_release": "Unapologetically", "intro": "A country-pop singer and songwriter out of Knoxville, Tennessee, Kelsea Ballerini started writing songs when she was 13 years old, began learning guitar a year later, and moved to Nashville at 15 to pursue her dream of being a professional singer and songwriter. Four years later in 2013, when she was 19, Ballerini signed a publishing deal with Black River Publishing and a recording deal with Black River Entertainment later that same year. A debut single, \"Love Me Like You Mean It,\" appeared from the label in 2014; the single slowly became a big hit, reaching number five on the Billboard country singles charts and number one on its country airplay charts. A digital EP, simply titled Kelsea Ballerini, was released in November 2014, and as word about Ballerini spread, she was named one of 2014's Next Women of Country by CMT and appeared on the Grand Ol' Opry for the first time on February 13, 2015. In May 2015, Black River released Ballerini's first full-length album, The First Time; it debuted at four on Billboard's U.S. country charts and 31 on the Billboard Top 200, eventually going gold. In June 2017, Ballerini released \"Legends,\" the first single from her follow-up LP Unapologetically, which appeared in November. ~ Steve Leggett"},
{"artist": "Thomas Rhett", "artist_link": "https://itunes.apple.com/us/artist/thomas-rhett/id502541718?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music128/v4/85/91/8b/85918b01-2a52-c914-3dcf-7b9531982b1f/source/146x146sr.jpg", "origin": "Valdosta, GA", "genre": "Country", "born": "Mar 30, 1990", "latest_release": "Life Changes", "intro": "Georgia-born singer/songwriter Thomas Rhett, the son of award-winning country crooner Rhett Akins, didn't seriously start considering following in his father's footsteps until his senior year in high school. Raised on a steady diet of Merle Haggard, Hank Williams, Led Zeppelin, and the Rolling Stones, Rhett inked a publishing deal with EMI just two years into his college career, and landed a song (\"I Ain't Ready to Quit\") on fellow country-rocker Jason Aldean's 2010 release, My Kind of Party. Like Aldean, Brantley Gilbert, and Justin Moore, Rhett splits the difference between slick contemporary country and rowdy good-time rock & roll, an equation he put to the test on his 2011 debut single, \"Something to Do with My Hands.\" A self-titled EP appeared early in 2013, and later that year his debut full-length, It Goes Like This, arrived. The album reached number six on the Billboard 200 and the Top 30 in Canada on the strength of the Top Ten Country hit singles \"It Goes Like This,\" \"Get Me Some of That,\" and \"Make Me Wanna,\" all of which topped Billboard's Country Airplay chart. Led by the single \"Crash and Burn,\" which reached number one on Billboard's Country Airplay chart and number two on the Hot Country chart, Rhett's sophomore album, Tangled Up, appeared in September 2015. A second number one smash, \"Die a Happy Man,\" and third single, \"T-Shirt,\" helped turn Tangled Up into a big hit that stayed on the charts into 2016. That year, a deluxe edition of the album appeared, featuring the single \"Star of the Show,\" which went into the Top Ten as well. In 2017, Rhett returned with his third studio-album, Life Changes, which included the single, \"Craving You,\" featuring Maren Morris. ~ James Christopher Monger"},
{"artist": "P!nk", "artist_link": "https://itunes.apple.com/us/artist/p-nk/id4488522?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Features118/v4/d0/b4/44/d0b4446d-4747-f50f-572b-1effb4b1ec3a/source/735x135sr.jpg", "origin": "Doylestown, PA", "genre": "Pop", "born": "Sep 8, 1979", "latest_release": "What About Us (Tiësto's AFTR:HRS Remix) - Single", "intro": "Although initially viewed as another face in the late-'90s crowd of teen pop acts, Pink (professionally known as P!nk) quickly transcended and outgrew that label with her combination of pop songcraft and powerhouse, rock-influenced vocals. Born Alecia Moore on September 8, 1979, in Doylestown, Pennsylvania, P!nk received her nickname as a child, years before she dyed her hair accordingly. She grew up in a musical family and was a regular on the Philadelphia club scene by the age of 13, first as a dancer and then as a backing vocalist for the local hip-hop group Schoolz of Thought. At 14, she began writing her own songs; the same year, a local DJ at Club Fever began inviting her on-stage to sing a song every Friday.P!nk was spotted one night by an executive for MCA Records, who asked her to audition for an R&B group called Basic Instinct. Although P!nk's strong vocals landed her the gig, the group imploded not long after. She was quickly recruited for a female R&B trio called Choice, who signed to L.A. Reid and Babyface's LaFace label on the strength of their demo; however, they too disbanded due to differences over musical direction. During Choice's brief studio time, producer Daryl Simmons asked P!nk to write a bridge section for the song \"Just to Be Loving You.\" Impressed with the results, P!nk rediscovered her songwriting muse, and an equally impressed L.A. Reid soon gave her a solo deal with LaFace.P!nk recorded her solo debut, Can't Take Me Home, with a variety of songwriting partners and dance-pop and R&B producers. Released in 2000, the album was a double-platinum hit; it spun off three Top Ten singles in \"There U Go,\" \"Most Girls,\" and \"You Make Me Sick.\" She toured that summer as the opening act for *N Sync, but soon found herself tired of being pigeonholed as strictly a teen act despite her sassy, forthright persona. As she set about working on her follow-up album, P!nk took part in the remake of Patti LaBelle's \"Lady Marmalade\" featured on the Moulin Rouge soundtrack, which also featured powerhouse divas Christina Aguilera, Mya, and Lil' Kim. The song was a massive hit, topping the charts in both the U.S. and U.K. while expanding P!nk's own audience.Toward the end of the year, P!nk released her next single, \"Get the Party Started,\" which climbed into the Top Five and became the singer's most inescapable hit to date. Her accompanying sophomore album, M!ssundaztood, quickly went double platinum; it boasted a more personal voice and an eclectic sound, plus heavy contributions from ex-4 Non Blondes singer Linda Perry, who helped bring some more rock muscle to P!nk's sound (as did guest appearances by Steven Tyler and Richie Sambora). M!ssundaztood attracted positive critical notices as well, and its second single, \"Don't Let Me Get Me,\" became another fast-rising Top Ten hit. P!nk next issued Try This in November 2003. The album continued her progression toward more rock-oriented material, due in part to the songwriting collaboration of Rancid frontman Tim Armstrong on eight of the album's tracks. Try This' lead single, \"Trouble,\" cracked the upper regions of Billboard's Top 40 and earned P!nk a Grammy Award for Best Female Rock Vocal Performance. On the home front, P!nk wed motocross racer Carey Hart -- whom she had initially met at 2001's X-Games -- on January 7, 2006, in Costa Rica. Her next album, I'm Not Dead, appeared that April; its first single, \"Stupid Girls,\" quickly became a hit, while \"Who Knew\" and \"U + Ur Hand\" both cracked the Top Ten. I'm Not Dead reached platinum status in several countries and helped ramp up anticipation for P!nk's follow-up, Funhouse, which arrived in October 2008. \"So What,\" the album's leadoff single, became her first number one hit since \"Lady Marmalade.\" Another hit, \"Please Don't Leave Me,\" followed in 2009 and all her hits were collected on the 2010 release Greatest Hits...So Far!!!, which was preceded by the single \"Raise Your Glass.\" Around the time of the release of Greatest Hits...So Far!!!, P!nk announced that she and her husband were expecting their first child.In September 2012, P!nk released her sixth studio album, The Truth About Love. With production from Greg Kurstin, Butch Walker, Max Martin, Dan Wilson, and others, it became her first number one album in America and earned platinum status in half a dozen countries. The singles \"Blow Me (One Last Kiss),\" \"Try,\" and \"Just Give Me a Reason\" all hit the Top Ten in the U.S., and the last became her fourth number one hit in America. P!nk mounted a yearlong tour -- the third best-selling in 2013, according to Billboard -- through Australia, Europe, and North America, and at the end of 2013 she was named Woman of the Year by Billboard. Taking a break from her solo work, P!nk teamed up with City and Colour vocalist Dallas Green for a collaborative acoustic effort called You+Me. They released their first album, Rose Ave., in October 2014. Rose Ave. debuted atop the Billboard folk chart and cracked the Billboard Top Five. The following year, P!nk wrote a new theme song for The Ellen Degeneres Show titled \"Today's the Day.\" She also contributed \"Just Like Fire,\" a new song, for the 2016 movie Alice Through the Looking Glass. P!nk returned in August 2017 with the socially charged song \"What About Us,\" the first single from her album Beautiful Trauma, which arrived in October. Upon release, the LP topped the Billboard 200, her second consecutive number one. ~ Steve Huey"},
{"artist": "Charlie Puth", "artist_link": "https://itunes.apple.com/us/artist/charlie-puth/id336249253?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Features60/v4/72/2e/2c/722e2c05-7105-0f66-b389-7653aa4cd464/source/735x135sr.jpg", "origin": "Rumson, NJ", "genre": "Pop", "born": "Dec 2, 1991", "latest_release": "Voicenotes", "intro": "American pop singer/songwriter Charlie Puth began his career with acoustic covers uploaded to YouTube. Ellen DeGeneres was an early supporter and she signed the Berklee College alum -- along with his duet partner, Emily Luther -- to her Warner Bros.-affiliated ElevenEleven label. Though nothing materialized from that deal, Puth eventually signed with Atlantic. In early 2015, he released his debut single, \"Marvin Gaye,\" a duet with Meghan Trainor. Shortly thereafter, he gained greater exposure as the co-songwriter, pianist, and featured vocalist on Wiz Khalifa's \"See You Again,\" recorded as a tribute to actor Paul Walker for the soundtrack to Furious 7. The ballad reached number one in several territories, including the U.S., U.K., Germany, Australia, Italy, and Norway. \"I Won't Tell a Soul\" was then released as his second proper solo single, with the EP Some Type of Love appearing in May 2015. However, promotion for \"I Won't Tell a Soul\" was scrapped as \"Marvin Gaye\" took off, reaching number one in the U.K. and New Zealand and going multi-platinum in the U.S. \"One Call Away,\" the next single culled from Puth's eventual debut full-length, appeared in August 2015 and was also certified platinum. The full-length Nine Track Mind finally saw release in the last week of January 2016. The album peaked in the Top Ten of the charts in the U.S., U.K., France, Australia, New Zealand, and Canada and spawned another hit, this time with Selena Gomez, on the Top Ten \"We Don't Talk Anymore.\" The single \"Attention\" followed in 2017, debuting in the Top Ten on Billboard's Hot 100. ~ Andy Kellman & Neil Z. Yeung"},
{"artist": "Luke Combs", "artist_link": "https://itunes.apple.com/us/artist/luke-combs/id815635315?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Music122/v4/db/66/50/db665089-fe77-cb0a-a69b-b39e68ebbd33/source/146x146sr.jpg", "origin": "Charlotte, NC", "genre": "Country", "born": "Mar 2, 1990", "latest_release": "This One's for You", "intro": "A native of Asheville, North Carolina, country singer/songwriter Luke Combs took joy in singing from a young age. During his high school years, Combs split his time between football and singing in local vocal groups, eventually picking up the guitar while attending college at Appalachian State. Taking inspiration from some of country's leading men like Tim McGraw and Luke Bryan, he began writing songs and soon released a pair of EPs in 2014. In 2015, his single \"Hurricane\" reached the Top Ten on iTunes' country chart and he quickly followed up with his third EP, This One's for You, later that year. Over the course of 2016, \"Hurricane\" continued to gain steam, winding up at number 13 on Billboard's Country Airplay charts early in 2017. This success led to Combs signing with Riverhouse/Columbia Nashville, who released Combs' full-length debut, also called This One's for You, in June 2017. ~ Timothy Monger"},
{"artist": "Khalid", "artist_link": "https://itunes.apple.com/us/artist/khalid/id82842423?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Music122/v4/9e/be/69/9ebe696c-63ed-71d8-fb29-640ad0f76542/source/146x146sr.jpg", "origin": "El Paso, TX", "genre": "R&B/Soul", "born": "1999", "latest_release": "Why Don't You Come On - Single", "intro": "Combining a voice that sounds made for classic soul with cutting-edge music, Khalid is a singer/songwriter from El Paso, Texas. Raised by a military family, Khalid lived in Germany and upstate New York before settling in Texas. He was first inspired to make music by his mother, who was a singer and loved '90s R&B artists such as Brandy and TLC. While still a teenager, he began making music in 2015, incorporating influences as wide-ranging as Frank Ocean, India.Arie, Alt-J, and Father John Misty in the songs he posted online. He eventually connected with the producer SykSense, who, along with Tunji Ige and Smash David, worked on Khalid's bittersweet breakout single \"Location.\" Released in mid-2016, the song hit the Top 10 of Billboard's Hot R&B Songs chart the following January. Another single, \"Hopeless,\" preceded Khalid's debut album American Teen, which arrived in March 2017. ~ Heather Phares"},
{"artist": "Kane Brown", "artist_link": "https://itunes.apple.com/us/artist/kane-brown/id930928857?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Music69/v4/9e/58/e9/9e58e937-673c-1b79-d44c-45bccd065e9d/source/146x146sr.jpg", "origin": "Georgia", "genre": "Country", "born": "Oct 21, 1993", "latest_release": "Kane Brown (Deluxe Edition)", "intro": "Tennessee's Kane Brown is a contemporary country singer/songwriter blessed with a rich baritone voice. Raised by a single mom, Brown grew up in Redbank, Tennessee, where he first became interested in music while in high school. Initially attracted to R&B, Brown decided to focus on country after winning an 11th grade talent contest with his rendition of Chris Young's \"Gettin' You Home (The Black Dress Song).\" Buoyed by that success, Brown began posting videos online of covers of songs by Brantley Gilbert, Alan Jackson, and others. He quickly developed a loyal following of viewers, a fan base that helped his own single, \"Don't Go City on Me,\" go viral upon its release in 2014. In 2015, Brown released his debut EP, Closer, which reached the Top Ten of the Billboard Country Albums chart. Following Closer, he also released the stand-alone single \"Used to Love You Sober.\" In early 2016, Brown signed a recording contract with RCA/Sony Music Nashville. That December, he returned with his eponymous full-length debut, Kane Brown, featuring the singles \"Ain't No Stopping Us Now\" and \"Thunder in the Rain.\" The album debuted at number one on the country charts and peaked at number ten on the Billboard 200. A third single, \"What Ifs,\" featuring Lauren Alaina, appeared in 2017. ~ Matt Collar"},
{"artist": "Kesha", "artist_link": "https://itunes.apple.com/us/artist/kesha/id334854763?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Features118/v4/b1/14/71/b114712f-a55f-9da3-d8f0-b3f7d4cd6ca3/source/735x135sr.jpg", "origin": "Los Angeles, CA", "genre": "Pop", "born": "Mar 1, 1987", "latest_release": "\n      ", "intro": "A brash and driven pop singer/songwriter, Kesha (Kesha Rose Sebert) was born in Los Angeles but moved to Nashville when she was four, where her mother -- a longtime songwriter -- had inked a publishing deal. (Over a decade prior to that, Pebe Sebert's biggest success had come with \"Old Flames Can't Hold a Candle to You,\" originally recorded by Joe Sun and later by Dolly Parton.) Before finishing high school, Kesha returned to L.A. for the sake of jump-starting her own music career, despite being set up to study psychology at Columbia. She soon met Dr. Luke, the co-writer and co-producer of Kelly Clarkson's \"Since U Been Gone\" (among several other hits), who was impressed with her demo recordings. Kesha penned the Veronicas' \"This Love\" and later contributed background vocals to Britney Spears' \"Lace and Leather,\" both of which were released in 2008. The biggest turning point came one year later, when she was tapped to contribute vocals to Flo Rida's Dr. Luke-produced \"Right Round,\" a number one Hot 100 hit.Kesha subsequently signed to RCA, and her debut album, Animal -- featuring collaborations with Dr. Luke, Max Martin, and Benny Blanco -- was released in early 2010. Animal proved to be a big hit, reaching the top of the Billboard 200 and spinning off the number one single \"TiK ToK.\" The nine-song EP Cannibal appeared at the end of the year. Its single, \"We R Who We R,\" became her second chart-topper, and \"Blow\" also reached the Top Ten. Cannibal was followed in 2011 by another stopgap release, I Am the Dance Commander + I Command You to Dance: The Remix Album. In 2012, she was called upon by rocker Wayne Coyne for The Flaming Lips & Heady Fwends, a collaborative album that partnered Kesha with Biz Markie on the track \"2012 (You Must Be Upgraded).\" Dr. Luke was back on board for her second official album, Warrior, but the more rock-influenced effort also found space for Coyne, punk godfather Iggy Pop, and the indie pop band fun. Preceded by the Billboard Top Ten single \"Die Young,\" Warrior was released in December 2012 and reached the Top Ten of the albums chart. Two other singles hit the Top 40: \"C'Mon\" and \"Crazy Kids.\" Kesha toured North America during 2013 as part of a co-headlining bill with Pitbull, and the duo also recorded a single together, \"Timber,\" which became Kesha's third number one hit. In late 2014, she sued Dr. Luke for an array of charges, including sexual assault, harassment, emotional abuse, and bad business practices; she also sought release from her contract with Dr. Luke's Kemosabe label. Although the courts initially rejected her claims, wide public support for Kesha caused Kemosabe to release her from her contract in early 2016. Her return to performing happened in April 2016, when she took the stage at Coachella to perform \"True Colors\" during Zedd's set. The studio version was released by the end of the month. Following her own world tour in the summer of that year, Kesha returned to the studio to complete work on her long-awaited third LP, Rainbow. \"Praying,\" the album's lead single, was released in July 2017, with the album arriving a month later. ~ Andy Kellman"},
{"artist": "Dua Lipa", "artist_link": "https://itunes.apple.com/us/artist/dua-lipa/id1031397873?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music18/v4/6f/95/1f/6f951f8f-eb9c-7ea7-d342-a89aeda078b3/source/146x146sr.jpg", "origin": "London, England", "genre": "Pop", "born": "Aug 22, 1995", "latest_release": "New Rules (Remixes) - EP", "intro": "English pop singer Dua Lipa showcased a throwback vibe and a knack for catchy pop with soulful grit, much like Sia, Jessie J, or P!nk, and a slyly rebellious air like Charli XCX and Marina & the Diamonds. Born and raised in London to Kosovar-Albanian parents, the sultry-voiced Lipa attended Sylvia Young Theater School (Rita Ora, Amy Winehouse) until the age of 13, when she relocated to Kosovo with her family. However, the move wouldn't last very long, and she was back in London by age 15, living on her own and pursuing a singing career. Her first demos were released in 2012, attracting the attention of Lana Del Rey's management team, who signed her and linked her up with Emile Haynie (Lana Del Rey, Bruno Mars). Her shimmery debut single, \"New Love,\" was followed up with the soulful \"Be the One.\" Longlisted for the prestigious BBC's Sound of 2016, Dua Lipa released \"Hotter Than Hell\" and \"Blow Your Mind (Mwah)\" in 2016, coinciding with a tour throughout the spring and summer. While \"Hotter Than Hell\" went on to break the Top 20 in the U.K., in 2017 she earned the distinction of having three simultaneously charting singles in the U.K. Top 15 with \"Be the One,\" \"Scared to Be Lonely\" with Martin Garrix, and \"No Lie\" with Sean Paul. Dua Lipa, her debut full-length, arrived that summer. In addition to her previously released singles, the album included \"Lost in Your Light,\" a duet with Miguel. ~ Neil Z. Yeung"},
{"artist": "Maren Morris", "artist_link": "https://itunes.apple.com/us/artist/maren-morris/id262260873?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Music111/v4/f4/58/d3/f458d3d6-8734-b0b6-d6ae-2a1717df63e5/source/146x146sr.jpg", "origin": "Dallas, TX", "genre": "Country", "born": "Apr 10, 1990", "latest_release": "Dear Hate (feat. Vince Gill) - Single", "intro": "Maren Morris is a singer and songwriter whose music bridges the gap between hard country, classic rock, and hip-hop-influenced pop, and has enjoyed success both as a tunesmith and as a performer. Morris was born in Dallas, Texas on April 10, 1990, and she grew up with a love of music, saying she was always willing to belt out a tune on the family's karaoke machine by age ten. By the time Morris was 14, she had learned to play guitar and began playing professionally, self-releasing a debut album, Walk On. Morris had struck a deal with Smith Music Group when she dropped her second album, 2007's All That It Takes; her songwriting was strong enough that she either wrote or co-wrote eight of the album's 13 tracks. Morris graduated high school and was attending the University of North Texas when she self-released her third full-length, 2011's Live Wire. A year later, she left Texas for Nashville, determined to shift her career into high gear.After winning an \"Artist on the Verge\" prize at the New Music Seminar, Morris first got her foot in the door as a songwriter, signing a publishing deal with Yellow Dog and writing tunes for Tim McGraw (\"Last Turn Home\") and Kelly Clarkson (\"Second Wind\"). In addition, she ramped up her touring schedule, sharing stages with artists as diverse as Pat Green, Radney Foster, and Marty Stuart, and performing for artists in Europe and the United Kingdom as well as the United States. In 2015, Morris released a digital single titled \"My Church,\" about the close connection between music and driving. The song became a viral hit, generating over 2.5 million streams in a bit longer than a month. The major labels in Music City took notice, and Morris signed a deal with Sony Music Nashville, who dropped a five-song EP featuring \"My Church\" in November 2015. Sony serviced \"My Church\" to country radio in anticipation of her full-length debut Hero, which appeared in June of 2016. The album hit number one on the country charts, and earned Morris a lot of attention; she was nominated for several Grammy awards, she won CMA's New Artist of the Year, and earned a slot on Saturday Night Live late in 2016. During early 2017, she toured (both as a headliner and with Sam Hunt), and released a deluxe edition of Hero including several bonus tracks. ~ Mark Deming"},
{"artist": "Cheat Codes", "artist_link": "https://itunes.apple.com/us/artist/cheat-codes/id957521979?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Music127/v4/40/85/b7/4085b768-fd62-6a60-692c-a523022b9941/source/146x146sr.jpg", "origin": "Los Angeles, CA", "genre": "Dance", "born": "2014", "latest_release": "\n      ", "intro": "Los Angeles-based electronic trio Cheat Codes debuted in 2015 with their single \"Visions,\" a floor-filling, radio-ready bite of house in a vein similar to Avicii and Swedish House Mafia. Each of the group's three members -- Matthew Russell, Trevor Dahl, and Kevin Ford -- has deep roots in L.A., working on individual projects before joining forces for Cheat Codes (Dahl once performed as singer/songwriter Pluginstereo). Their different backgrounds helped inform Cheat Codes' stylistically varied sound, which can range from warm pop to outright big house bangers. After the release of \"Visions,\" they quickly followed with the tropical-tinged \"Don't Say No\" (featuring Dresses), \"Senses\" (featuring Lostboycrow), and \"Adventure\" (featuring Evan Gartner). As they gained exposure on social media and spins on streaming services, they joined the Chainsmokers on tour. Successive singles continued to drop in 2016, when they unveiled a pair of global hits, \"Sex\" (featuring Kris Kross Amsterdam) and \"Let Me Hold You (Turn Me On)\" (with Dante Klein). The following year they released their biggest feature yet, \"No Promises\" with Demi Lovato on vocals, and embarked on the No Promises world tour (taking them to the U.S., Europe, and Australia). They followed their Lovato hit with \"Feels Great,\" which featured Fetty Wap and CVBZ. ~ Neil Z. Yeung"},
{"artist": "Alice Merton", "artist_link": "https://itunes.apple.com/us/artist/alice-merton/id658208216?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Features117/v4/3b/1f/27/3b1f27b9-2852-c6c2-d019-c1dd42152def/source/735x135sr.jpg", "origin": "Frankfurt, Germany", "genre": "Alternative", "born": "Sep 13, 1993", "latest_release": "No Roots - Single", "intro": "Growing up around the world, singer/songwriter Alice Merton was as influenced by other cultures as much as transience itself. Born in Frankfurt and raised in Canada and England, Merton's absorption of different styles and sounds helped craft the worldly progressive pop leanings on her debut, which came out in 2017. As a child, she learned classical piano and singing while in Canada. When Merton was a teenager, her family moved to Germany, where she would pick up the guitar and write her first song. While in Germany, she also studied at the Mannheim conservatory of music. Later, the family would relocate again, this time to England. These frequent international shifts would play a key role in the songwriting process for her first output, 2017's No Roots EP (Mom+Pop Records). The four-track effort included the groove-heavy title track and \"Hit the Ground Running,\" which won Merton the Jugend Kulterell Prize for Acoustic Pop. ~ Neil Z. Yeung"},
{"artist": "Chris Janson", "artist_link": "https://itunes.apple.com/us/artist/chris-janson/id319072950?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Music5/v4/f0/83/a6/f083a655-ce3c-779d-4ef8-4aff8bfda72f/source/146x146sr.jpg", "origin": "Perrysville, MO", "genre": "Country", "born": "Apr 2, 1986", "latest_release": "EVERYBODY", "intro": "Country singer and songwriter Chris Janson was born and raised in Missouri but moved to Nashville to pursue music the summer after finishing high school. A guitarist as well as a stellar harmonica player, Janson first made his mark as a songwriter, penning Tim McGraw's 2012 hit \"Truck Yeah,\" and he's co-written with former Guns N' Roses members Duff McKagan and Izzy Stradlin, among others. He released his first single, \"'Til a Woman Comes Along,\" for BNA Records in the spring of 2010, but left the label when it was restructured. After signing with McGraw's Bigger Picture Music Group, he released a second single, \"Better I Don't,\" produced by the legendary Keith Stegall, early in 2013. He released a self-titled EP later that year, which cracked the Billboard Top Country Albums chart. Another EP, Take It to the Bank, followed in early in 2014, and in early 2015, he released the single \"Buy Me a Boat\" without any label support. After receiving play on the nationally syndicated country radio program The Bobby Bones Show, the song climbed into the Top Ten of the country charts and earned Janson a deal with Warner Bros. in the spring, as well as a performance spot on the CMT Music Awards telecast that June. That summer, \"Buy Me a Boat\" made its way into the Top Ten and was quickly followed by \"Outlaw Ways,\" a single that failed to make any waves and ultimately wasn't included on Buy Me a Boat, the full-length debut that appeared in October. Alongside \"Buy Me a Boat\" came a pair of new singles, the rowdy \"Power of Positive Drinkin'\" and the heartfelt \"Holdin' Her.\" In early 2017, Janson dropped the single \"Fix a Drink,\" in anticipation of the release of an EP of the same name, which arrived later that July. \"Fix a Drink\" also appeared on Everybody, the sophomore album that appeared in September 2017. ~ Steve Leggett & Marcy Donelson"},
{"artist": "The Revivalists", "artist_link": "https://itunes.apple.com/us/artist/the-revivalists/id288615324?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Music71/v4/b1/55/f5/b155f5c7-523c-32d8-e437-5e90de0c2eeb/source/146x146sr.jpg", "origin": "New Orleans, LA", "genre": "Alternative", "born": "2007", "latest_release": "Wish I Knew You - Single", "intro": "A group of roots rock iconoclasts who call New Orleans home, the Revivalists formed in 2007 and wound up gaining traction in the early years of the next decade, with their second album, City of Sound, appearing on the Billboard charts upon its re-release from Wind-Up Records in the spring of 2014.Vocalist David Shaw, guitarist Zack Feinberg, pedal steel player Ed Williams, bassist George Gekas, drummer Andrew Campanelli, saxophonist Rob Ingraham, and keyboardist/trumpeter Michael Girardot became known for their amalgam of rock, R&B, soul, country, and funk in New Orleans in the closing days of the 2000s, releasing an eponymous EP in 2008. Two years later, the full-length Vital Signs appeared and they began getting good reviews for their opening sets for the Rebirth Brass Band along with their constant touring and festival appearances. A second album produced by Ben Ellman called City of Sound appeared independently in 2012. In 2013, they signed with Wind-Up Records and set out to record their third album. In the meantime, Wind-Up reissued City of Sound in the spring of 2014 and it wound up hitting the lower reaches of the Billboard 200. Recorded straight to tape, Men Amongst Mountains, the band's third studio long player, arrived in July 2015.~ Stephen Thomas Erlewine"},
{"artist": "Florida Georgia Line", "artist_link": "https://itunes.apple.com/us/artist/florida-georgia-line/id399241518?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Features41/v4/2c/bd/e8/2cbde843-6c04-e044-2e65-99f34a6e86b4/source/735x135sr.jpg", "origin": "Nashville, TN", "genre": "Country", "born": "2010", "latest_release": "Dig Your Roots", "intro": "Florida Georgia Line came out of nowhere in 2012 to become the biggest country group of the new decade. The vehicle of their success was \"Cruise,\" a slick, shimmering ode to the wide-open road that became an unkillable crossover hit in 2013 and, eventually, the biggest country single of all time. After \"Cruise\" broke through on its own merits, reaching 16 on the Billboard Hot 100, its life was extended thanks to a remix featuring rapper Nelly. This unexpected collaboration pushed the single all the way to number four on the Hot 100, but at that point it was clear that the appeal of \"Cruise\" lay in Florida Georgia Line's unabashedly polished pop perspective. Unlike some fellow contemporary country bros, the duo of Brian Kelley and Tyler Hubbard didn't swagger; they were bright, sunny, and friendly, qualities showcased on subsequent hits \"Get Your Shine On\" and \"Round Here.\" Where some of their peers -- tagged as \"bro country\" due to their macho swagger and frat-friendly sensibility -- stumbled on their second or third albums, Florida Georgia Line stayed on the top of the charts with 2014's Anything Goes and 2016's Dig Your Roots.Brian Kelley and Tyler Hubbard -- the former hails from Ormond Beach, Florida, the latter Monroe, Georgia, hence their band name -- met as students at Nashville's Belmont University, and began writing songs together between classes. Soon, they were playing local clubs, quickly building a fan following on the Southeast club circuit and developing a sharp contemporary country sound. After self-releasing an EP of originals called Anything Like Me in December 2010, the duo signed a publishing and management deal with Big Loud Mountain, then entered the studio with producer Joey Moi to track an EP, It'z Just What We Do. It'z Just What We Do appeared in May of 2012, preceded by the single \"Cruise.\" Within two months, the single debuted on the Billboard Hot Country Songs chart, where it would reside for months on end. On December 15, 2012, it wound up topping the country charts for the first time. It would stay at the top for 24 weeks, shattering the previous long-held record of 21 weeks at the top, a record held jointly by Webb Pierce's 1955 hit \"In the Jailhouse Now,\" Hank Snow's 1950 \"I'm Movin' On,\" and Eddy Arnold's 1947 \"I'll Hold You in My Heart ('Til I Can Hold You in My Arms).\" As \"Cruise\" ruled the country charts, a pop-oriented remix featuring rapper Nelly appeared as a separate single, turning the song into a pop hit; it climbed all the way to four on the Hot 100. \"Cruise\" kept many other hits away from the number one position and that included two subsequent singles by Florida Georgia Line: the January 2013 single \"Get Your Shine On\" and its sequel, \"Round Here.\" Both of these were huge hits, topping the Country Airplay chart on their way to platinum certification, but they were dwarfed by \"Cruise,\" which wound up selling over 6,500,000 units on its way to becoming the biggest country single of all time. Naturally, the accompanying Here's to the Good Times album also became a hit, reaching number one on the Country Albums chart in the summer of 2013 on its way to over 1.5 million in sales; it was reissued as an expanded edition called Here's to the Good Times...This Is How We Roll for the holiday season of 2013, with their duet with Luke Bryan called \"This Is How We Roll\" added to the album (which also reached number one on the country chart). In July of 2014, Florida Georgia Line released the single \"Dirt,\" another country chart-topper that heralded the release of their second album. Working once again with Joey Moi, the band released Anything Goes in October 2014. It debuted at number one on the Billboard 200 on the strength of sales of 197,000 copies. Over the next year, the album spawned four additional Billboard country hits: \"Sun Daze,\" \"Sippin' on Fire,\" \"Anything Goes,\" and \"Confession.\" This kept Florida Georgia Line on the charts into 2016, when they released \"H.O.L.Y.,\" the first single from their third album. \"H.O.L.Y.\" went to number one, setting the stage for the August release of Dig Your Roots. ~ Stephen Thomas Erlewine & Steve Leggett"},
{"artist": "Cardi B", "artist_link": "https://itunes.apple.com/us/artist/cardi-b/id956078923?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Music128/v4/12/32/47/12324792-3767-b9a1-5ee5-a77bc2d833ad/source/146x146sr.jpg", "origin": "Bronx, NY", "genre": "Hip-Hop/Rap", "born": "Oct 11, 1992", "latest_release": "MotorSport - Single", "intro": "Gaining exposure as a popular cast member of VH1's Love & Hip Hop: New York, rapper Cardi B is also a raw and aggressive rapper in the style of Lil' Kim and Foxy Brown. The former stripper and social media star made her television debut on the reality show in late 2015, joining a cast that included Remy Ma. A year later, she made her musical debut alongside dancehall singer Popcaan on Shaggy's \"Boom Boom\" single. The solo single \"Cheap Ass Weave\" and the mixtape Gangsta Bitch Music, Vol. 1 soon followed, both in early 2016. Two more singles, \"Foreva\" and \"Wash Poppin',\" followed that summer. A second mixtape, Gangsta Bitch Music, Vol. 2, was released in early 2017. That same year, Cardi signed with Atlantic Records and scored a hit with the single \"Bodak Yellow,\" which climbed to the top spot of the Billboard Hot 100 in late September. ~ David Jeffries"},
{"artist": "Grace VanderWaal", "artist_link": "https://itunes.apple.com/us/artist/grace-vanderwaal/id1175539534?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music118/v4/d1/d2/20/d1d22068-0e99-1215-16be-55b3b07c4cb4/source/146x146sr.jpg", "origin": "Lenexa, KS", "genre": "Pop", "born": "Jan 15, 2004", "latest_release": "Just the Beginning", "intro": "New York's Grace VanderWaal is a heartfelt pop singer best known for winning the 11th season of NBC's performance competition America's Got Talent. Born in Kansas in 2004, VanderWaal grew up in Suffern, New York, where she first showed interested in music around age three, singing on a wireless microphone. Later, she played saxophone in the school band and, at age 11, taught herself to play ukulele by watching online videos. Soon, she was writing her own songs and performing at local open-mike nights. In 2016, she successfully auditioned for America's Got Talent, performing her original composition \"I Don't Know My Name.\" A popular competitor from the start, VanderWaal ultimately won the series, becoming the second female and second child to do so. She signed to Columbia Records in 2016 and released her debut EP, Perfectly Imperfect, featuring her single version of \"I Don't Know My Name.\" The album debuted at number nine on the Billboard 200 chart. The non-album single \"Missing You,\" appeared in 2017. ~ Matt Collar"},
{"artist": "Miranda Lambert", "artist_link": "https://itunes.apple.com/us/artist/miranda-lambert/id18732261?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Features71/v4/53/50/5d/53505de3-55bc-4a82-c48b-f1faecb44ed7/source/735x135sr.jpg", "origin": "Lindale, TX", "genre": "Country", "born": "Nov 10, 1983", "latest_release": "The Weight of These Wings", "intro": "Miranda Lambert defied all conventional notions of how a credible country career should proceed. Following an adolescence where she alternated between singing and acting, she came to prominence not as the winner but as a runner-up on the 2003 American Idol knockoff Nashville Star, a dubious stepping stone to stardom if ever there was one, but Lambert's 2005 Kerosene obliterated any notion that she was a reality TV refugee. Filled with lithe, powerful, neo-traditional country songs, many penned by Lambert herself, Kerosene established the singer/songwriter as a commercial force to be reckoned with, while its 2007 sequel, Crazy Ex-Girlfriend, pulled off the trick of turning her into a superstar while confirming she was a writer of considerable substance. From there, the hits piled up fast and furious -- most of them from her multi-platinum records Revolution, Four the Record and Platinum, but some coming from her side project Pistol Annies -- and tabloid headlines started to flow after she married fellow country star Blake Shelton in 2011. By that point, she could weather the gossip because there was no mistaking Miranda Lambert as anything but a major figure in country music.Raised by parents who were also professional partners in a private investigator agency (her father Rick was also a guitarist who taught his daughter how to play), Lambert began playing music early, entering talent competitions as a singer when she was 16. She performed well enough to be offered a demo recording contract in Nashville but she bailed on the sessions, claiming the music was too pop. She headed back to Texas, where she learned to play guitar with the idea of writing her own songs. As she was woodshedding this skill, she continued to sing, fronting a variety of local bands around Longview, Texas at ballrooms, dance halls, and restaurants. Additionally, she perused opportunities as an actress, appearing in a Ruffles potato chip commercial and landing a small role in the 2001 comedy Slap Her She's French, but her main concentration was music, particularly the Texas Pride band she fronted. In 2001, she and her father self-financed an eponymous independent album that made local waves: \"Texas Pride\" and \"Somebody Else\" garnered enough local play that they appeared on Texas music charts. Things started to gel in 2002 when she gained the attention of music attorney Rod Phelps, who pulled enough strings in Nashville to persuade her to move back to the Music City. Once there, she auditioned for the fledgling television show Nashville Star, a singing competition launched by USA Networks in 2003 in the wake of the massive success of American Idol. Lambert made it to the finale but didn't win -- she was eclipsed by Buddy Jewell -- yet her success on the show piqued the interest of Epic Records, who signed her to a deal in September 2003 (her Epic contract would later transfer to Sony Nashville). A single, \"Me and Charlie Talking,\" appeared in 2004, with the full-length debut, Kerosene, released in the spring of 2005. Lambert wrote or co-wrote 11 of the 12 songs on her debut, including the title track, which made it to 16 on Billboard's Country Singles chart on its way to eventual platinum certification. Kerosene the album also reached platinum status, but her 2007 sophomore set Crazy Ex-Girlfriend is where Lambert demonstrated her commercial muscle. Debuting at number one on the Billboard Country chart and six on Billboard's Top 200, Crazy Ex-Girlfriend boasted two big hits in \"Famous in a Small Town\" and \"Gunpowder & Lead,\" the latter reaching seven on the Country chart on its way to double-platinum certification; \"More Like Her\" was also a hit, making its way to 17. Released in September 2009, third album Revolution was her blockbuster -- her biggest seller containing her biggest hit singles. \"The House That Built Me\" became her first number one single -- it would be certified platinum twice over, whereas its predecessor, \"White Liar,\" went platinum and peaked at two -- and \"Heart Like Mine\" also reached the top; \"Only Prettier\" peaked at 12. Buttressed by this success, Lambert decided to venture into a side project called Pistol Annies with fellow singer/songwriters Ashley Monroe and Angaleena Presley. Their debut, Hell on Heels, appeared in August 2011 and went gold, partially on the strength of good reviews, partially on the strength of its platinum-selling title track; the album debuted at five on Billboard's Top 200.Arriving quickly on the heels of Hell on Heels -- less than three months later, to be precise -- came Lambert's fourth solo album, Four the Record. A hit right out of the box -- it debuted at three on the Top 200 and one on the country charts -- Four the Record contained four Top Ten country hits (\"Baggage Claim,\" the number one \"Over You,\" \"Fastest Girl in Town,\" and \"Mama's Broken Heart\"; \"All Kind of Kinds\" topped out at 15) and helped cement Lambert's position as the reigning queen of country music in the 2010s. Her status was also elevated by her marriage to fellow country star Blake Shelton in 2011, the same year he landed a starring role on NBC's televised singing competition The Voice and broke into the pop mainstream via his single \"Honey Bee.\" Soon, Lambert and Shelton were gossip favorites but Lambert kept working hard. She returned to acting in a guest spot on a Law & Order: Special Victims Unit episode in 2012, Pistol Annies released a second album, Annie Up, in May 2013 -- the album debuted at five on the Top 200, two on the country charts; its single \"Hush Hush\" didn't crack the Top 40 -- and in June 2014 she delivered her fifth album, Platinum. Supported by the Top Ten singles \"Automatic,\" the Carrie Underwood duet \"Somethin' Bad,\" and \"Little Red Wagon,\" Platinum was another big hit for Lambert. During the summer of 2015, she and Shelton announced they were divorcing and she then entered the studio to record her sixth album. \"Vice,\" the first single from these sessions, appeared in July 2016, peaking at number two on Billboard's country chart. It was a teaser from the moody, muddy double album The Weight of These Wings, which was released in November 2016. ~ Stephen Thomas Erlewine"},
{"artist": "Eric Church", "artist_link": "https://itunes.apple.com/us/artist/eric-church/id123055194?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Features62/v4/05/92/ae/0592ae74-53b6-8f62-d6fd-2fef68ed05d1/source/735x135sr.jpg", "origin": "Granite Falls, NC", "genre": "Country", "born": "May 3, 1977", "latest_release": "Guys Like Me (Acoustic / Live At Casper Events Center, Casper, WY / April 4, 2017) - Single", "intro": "Country singer/songwriter/guitarist Eric Church grew up in Granite Falls, North Carolina, and began singing as a child. At 13, he started writing songs, later teaching himself to play guitar. While attending college at Appalachian State, he formed a band, the Mountain Boys, that played around western North Carolina. After graduating with a degree in marketing, he moved to Nashville, Tennessee to pursue a career in country music. It took him a year to get a song publishing deal with Sony/ATV, after which he started having his songs recorded by other artists, an example being Terri Clark's version of \"The World Needs a Drink.\" He met producer Jay Joyce, who took an interest in him as a recording artist, and they began making demos. That led to his being signed by Capitol Records Nashville. Church's debut single, \"How 'Bout You,\" was released in early 2006, and it had reached the country Top 20 by the time Capitol released his first album, Sinners Like Me, in July 2006. The album was both a critical and commercial success, and Church followed it up with Carolina in 2009, which swung for the contemporary country fences and hit them, scoring two Top Ten singles on the country charts with \"Love Your Love the Most\" (certified gold) and \"Hell on the Heart.\" In 2010, he scored another gold single with \"Smoke a Little Smoke\" in 2010. He won Top New Solo Vocalist at the Academy of Country Music Awards for that calendar year. After extensive touring, Church released the Caldwell County EP in January of 2011, which reached the number 13 position on the Billboard country chart, as did the single \"Homeboy.\" Church followed with the album Chief in July. Chief wound up being Church's entry into superstardom. Upon its July 2011 release, it debuted at number one on both the Billboard 200 and the Top Country Albums chart. Soon afterward, \"Drink in My Hand\" climbed to the top of the country charts, becoming Church's first number one single. Its popularity was eclipsed in the summer of 2012 by \"Springsteen,\" a ballad that also reached number one on the country charts but additionally crossed over to the pop Top 20. Two other singles were pulled from Chief -- \"Creepin'\" and \"Like Jesus Does\" -- and the album won Album of the Year at the 2012 Country Music Academy Awards.Early in 2013, Church released the live set Caught in the Act, which was recorded at the Tivoli Theatre in Chattanooga, Tennessee in October 2012; the album debuted at number five on the Billboard 200. Church spent the rest of 2013 working on his fourth studio album. The first taste of this work was the heavy rock of \"The Outsiders,\" a single that turned out to be the album's title track. Preceded by the second single, \"Give Me Back My Hometown\" (which followed the title track into the country Top Ten), The Outsiders arrived after considerable anticipation and acclaim in February 2014. It became his second album to hit number one on both the country and overall charts. The Outsiders racked up five hit singles -- the biggest were the ballads \"Give Me Back My Hometown\" and \"Talladega,\" both of which reached number one on Billboard's U.S. Country Airplay charts -- and while \"Like a Wrecking Ball\" remained on the charts, Church released a brand-new full-length album, Mr. Misunderstood, as a surprise in the first week of November 2015. Mr. Misunderstood debuted at two on Billboard's Top 200 and Country Charts, eventually earning a Gold certification and winning CMA's Album of the Year in 2016, along with spawning three hit singles: \"Mr. Misunderstood,\" \"Record Year,\" and \"Kill a Word,\" which featured Rhiannon Giddens on its single version. In November 2016, Church released the EP Mr. Misunderstood on the Rocks Live and (Mostly) Unplugged. A fourth single off Mr. Misunderstood, \"Round Here Buzz,\" appeared in 2017 and reached the Top 20 of Billboard's Country Songs chart. ~ William Ruhlmann"},
{"artist": "Scotty McCreery", "artist_link": "https://itunes.apple.com/us/artist/scotty-mccreery/id425025684?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Music2/v4/75/d5/69/75d56972-e2fc-d23d-77c5-cbeb2273b5a0/source/146x146sr.jpg", "origin": "Garner, NC", "genre": "Country", "born": "Oct 9, 1993", "latest_release": "Five More Minutes - Single", "intro": "The winner of American Idol’'s tenth season, country crooner Scotty McCreery began singing as a child in Garner, North Carolina. School performances eventually gave way to local competitions, and McCreery won a singing contest in the nearby town of Clayton before trying out for American Idol as a 16-year-old. Auditioning with Josh Turner's \"Your Man,\" he made good use of his country twang and deep baritone vocals, prompting the judges to compare him to Randy Travis. McCreery passed the audition, became an audience favorite, and eventually won the competition in May 2011. Lauren Alaina, another teenage country singer and a close friend of McCreery's, took home the second place title. McCreery's coronation song was \"I Love You This Big,\" a country ballad that sold nearly 175,000 copies during its first week of release. The song also cracked the country charts at number 32, making it the highest-charting debut single in country history, and helped stir up anticipation for his full-length album, which he recorded while preparing for American Idol’s summer tour. Clear as Day appeared in the fall of 2011 from Mercury Nashville, debuting at number one on the Billboard Top 200 the week of its release. It went on to be one of the better-selling latter-day Idol-related records, earning a platinum certification and producing another hit single in \"The Trouble with Girls.\" The following year, McCreery released the seasonal Christmas with Scotty McCreery in time for the 2012 holiday season. In October 2013, he returned with his second official studio album, See You Tonight. Produced by veteran producer Frank Rogers, the album moved McCreery into bright contemporary country-pop. It was a commercial and critical success, debuting at number one on Billboard's Country Albums chart and earning widespread acclaim, including McCreery's win of the Breakthrough Artist Award at the 2013 American Country Awards. In 2015, he issued a new single, \"Southern Belle,\" and toured with Rascal Flatts. 2017 saw the release of the poignant \"Five More Minutes,\" the first single from his highly anticipated third studio LP. ~ Andrew Leahey"},
{"artist": "ZAYN", "artist_link": "https://itunes.apple.com/us/artist/zayn/id973181994?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Features118/v4/83/22/40/83224002-203f-75dd-56b0-9307ef643bd0/source/735x135sr.jpg", "origin": "", "genre": "Pop", "born": "", "latest_release": "Dusk Till Dawn (feat. Sia) [The Remixes] - Single", "intro": "Zayn Malik is best known as one of the founding members of the boy-band-of-a-generation One Direction. Born Zain Javadd Malik on January 12, 1993 in the working-class town of Bradford in West Yorkshire, England, Zayn honed his vocal talents and stage command at a young age. Growing up as a mixed race Pakistani-English Muslim in a postindustrial British town presented some difficulties, which resulted in a number of primary school changes. His talents were eventually fostered at Tong High School, where he delved into performing arts and stage production, even starring as Danny Zuko in the school's production of Grease. In 2010, he auditioned for The X Factor but was eliminated (along with his future One Direction bandmates, who also auditioned solo). The quintet was later brought back as a group and Simon Cowell dubbed them One Direction. Despite finishing in third place, their popularity exploded and would not slow their trajectory until the very end. After the show, Cowell immediately signed them to his label, Syco Records, kicking off a craze that hadn't been seen since the turn of the millennium with the Backstreet Boys and *NSYNC. From 2011 to 2014, One Direction released an album each year, each one more successful than the last. Their fourth album, Four, would turn out to be the last with Zayn. In March 2015, while the band was on the On the Road Again Tour, Malik abruptly parted ways with One Direction a week after his final appearance with the group in Hong Kong. Citing stress and a desire for a simpler life out of the spotlight, Malik later revealed that he simply wanted to make music that he could listen to and enjoy. Striking out on his own, he signed with RCA Records and moved to Los Angeles, where he began working on his solo effort with Naughty Boy (Beyoncé, Sam Smith). The two soon parted and Malik turned to Frank Ocean collaborator James \"Malay\" Ho for production help. His debut single, \"Pillowtalk,\" was released in late January 2016, debuted at number one on the Billboard charts, and featured a distinctly more adult-themed alt-R&B sound, similar to the Weeknd and Miguel. His full-length debut, Mind of Mine, was released in early 2016 and topped the Billboard 200 chart. Late that year, he returned with the single \"I Don't Wanna Live Forever,\" a collaboration with Taylor Swift and Bleachers' Jack Antonoff that appeared on the soundtrack to Fifty Shades Darker. ~ Neil Z. Yeung"},
{"artist": "Thirty Seconds to Mars", "artist_link": "https://itunes.apple.com/us/artist/thirty-seconds-to-mars/id2307416?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Features118/v4/7e/1c/fd/7e1cfdcd-f17c-a939-a006-88030b492a21/source/735x135sr.jpg", "origin": "", "genre": "Alternative", "born": "", "latest_release": "Walk On Water - Single", "intro": ""},
{"artist": "Brett Eldredge", "artist_link": "https://itunes.apple.com/us/artist/brett-eldredge/id351352781?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music/v4/e8/75/54/e87554ab-6666-1ac3-5938-b110a6c1a50e/source/146x146sr.jpg", "origin": "Paris, IL", "genre": "Country", "born": "Mar 23, 1986", "latest_release": "Brett Eldredge", "intro": "Singing country music with a soulful edge and more than a dash of pop polish, Brett Eldredge was born in Paris, Illinois on March 23, 1986, and grew up listening to singers Ray Charles, Frank Sinatra, and Bobby Darin. After hearing Brooks & Dunn at the age of 16, he became fascinated by country music, a fascination that stayed with him when he began attending Elmhurst College in Chicago. After a trip to Nashville, where he heard his cousin Terry Eldredge (a veteran of Dolly Parton's band and a member of the Grascals) play at the Station Inn, Eldredge was inspired to transfer to Middle Tennessee State University, immersing himself in the vocal stylings of country singers like George Jones, Ray Price, and Vince Gill. He also began working on writing his own material and started performing at songwriter nights in the Nashville area. Eventually he was introduced to producer and publisher Byron Gallimore, who signed Eldredge to his publishing company and encouraged him to keep writing songs. Eldredge began tracking some of the best of his compositions, and following a showcase in Nashville, signed a recording offer from Atlantic Records. Eldredge's first single, \"Raymond,\" a poignant song about an Alzheimer's patient, was issued in September of 2010 and earned respectable radio play. Eldredge's next single, 2011's \"It Ain't Gotta Be Love,\" didn't fare as well, but 2012's \"Don't Ya\" was a genuine hit, selling over a million units and peaking at number five on the Country Singles chart. In August 2013, Eldredge issued his first album, Bring You Back, which included \"Raymond\" and \"Don't Ya\" as well as subsequent hits \"Beat of the Music\" and \"Mean to Me.\" Eldredge was one of the opening acts on Taylor Swift's 2013 concert tour, and in 2015 he toured in tandem with Darius Rucker. May 2015 brought Eldredge another country hit, \"Lose My Mind,\" which rose to number 12 on the Hot Country Songs chart, and \"Just a Taste\" followed in July 2015.Released on September 11, 2015, Eldredge's second album, Illinois, solidified his country stardom thanks to a pair of singles that reached number two on Billboard's Hot Country chart: \"Lose My Mind\" and \"Drunk on Your Love.\" \"Wanna Be That Song,\" which peaked at 17, kept Illinois on the charts into 2016, and in October of that year he released the holiday album Glow. Eldredge delivered the single \"Somethin' I'm Good At\" in February 2017, six months prior to the August release of his eponymous third album. ~ Steve Leggett"},
{"artist": "Old Dominion", "artist_link": "https://itunes.apple.com/us/artist/old-dominion/id495761008?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is3-ssl.mzstatic.com/image/thumb/Music3/v4/a1/64/06/a164060d-846b-7b1c-6099-befd97dbadd4/source/146x146sr.jpg", "origin": "Nashville, TN", "genre": "Country", "born": "2007", "latest_release": "Happy Endings", "intro": "Forging country with rock instrumentation and dynamics, and tossing in definite pop overtones and even some hip-hop nuances, Old Dominion is blessed with strong in-house songwriting and playing, sharpened by steady gigging on the Nashville circuit, where the band formed. Comprising four Virginians, Matt Ramsey (lead singer, guitar), Geoff Sprung (bass, vocals), Whit Sellers (drums), Brad Tursi (guitar, vocals), and Detroit, Michigan's Trevor Rosen (guitar, keyboards, vocals), the band formed in Nashville. Boasting top-flight modern country songwriters in Ramsey, Rosen, and Tursi (the Band Perry, Keith Urban, Luke Bryan, Dierks Bentley, Chris Young, and Craig Morgan have all tracked Old Dominion songs), the band soon attracted a lot of attention. Working in the studio with Shane McAnally and Ilya Toshinsky, Old Dominion released a self-titled debut EP in the fall of 2014. The single \"Break Up with Him\" earned notice early the following year, due in part to the band's Back to the Future-referencing video. In the summer of 2015, \"Break Up with Him\" went to number one on Billboard's Country Airplay charts, setting the stage for the November release of the band's Shane McAnally-produced debut Meat & Candy. In March 2017, the group dropped a single, \"No Such Thing as a Broken Heart,\" the first song from their second album. Happy Endings, which reunited the group with producer Shane McAnally, appeared in August 2017. ~ Steve Leggett"},
{"artist": "James Arthur", "artist_link": "https://itunes.apple.com/us/artist/james-arthur/id193502798?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is3-ssl.mzstatic.com/image/thumb/Features62/v4/e5/71/00/e571000b-47bf-470f-d23c-86788969dc7c/source/735x135sr.jpg", "origin": "Middlesbrough, Yorkshire, England", "genre": "Pop", "born": "Mar 2, 1988", "latest_release": "Can I Be Him (Acoustic Live Version) - Single", "intro": "James Arthur was the victor of the British X Factor's ninth season in 2012, winning the public vote with a rendition of Shontelle's rousing ballad \"Impossible.\" Born in Middlesbrough, England, Arthur had written and performed in various bands since the age of 15, as well as performing solo in pubs and bars in his hometown. Many early recordings of the singer/songwriter illustrate the pop/rock and hip-hop influences that helped to shape his unique voice and style. Before he appeared on The X Factor, Arthur made it into the final 200 contestants of the U.K.'s The Voice TV series in 2011, without managing to progress any further. A year later, he auditioned for The X Factor, where he sang judge Tulisa Contostavlos' song \"Young\" and subsequently made it through the boot camp round and into the live shows. From then on, Arthur showcased his considerable talents and slowly improved under the watchful eye of mentor Nicole Sherzinger. He was pitted against Jahméne Douglas and Christopher Maloney in the final round of the contest, where he impressed the audience with performances of Cy Grant's \"Feeling Good,\" Bob Dylan's \"Make You Feel My Love,\" and Marvin Gaye's \"Let's Get It On.\" The final song of the evening -- the version of Shontelle's \"Impossible\" -- was released immediately after Arthur was announced as the winner and made it to number one in the U.K. and Ireland, while also charting across Europe. He then went on tour with the X Factor show, playing across the U.K. in huge, sold-out arenas such as Wembley and the Birmingham LG. After his X Factor success, Arthur worked alongside singer/songwriter Labrinth and Graham Stack (JLS, Take That, Westlife) in preparation for his debut album. He put out the eponymous release later that year; the album featured \"Impossible\" and \"Roses\" (with Emeli Sandé), as well as follow-up singles \"You're Nobody 'Til Somebody Loves You,\" \"Recovery,\" and \"Get Down.\" Arthur departed from Syco Music the following year and briefly returned to the scene with an independent release, the rap mixtape All the World's a Stage. The singer/songwriter made a return in 2016, signing a record deal with Columbia and issuing his second full-length effort, Back from the Edge. The stripped-down and reflective record was led by the singles \"Say You Won't Let Go\" and \"Remember Who I Was.\" ~ Scott Kerr"},
{"artist": "Sofi Tukker", "artist_link": "https://itunes.apple.com/us/artist/sofi-tukker/id998656537?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Music128/v4/95/1f/80/951f8095-5703-10a7-1647-c5f795ab3cae/source/146x146sr.jpg", "origin": "New York, NY", "genre": "Dance", "born": "2014", "latest_release": "Best Friend (feat. NERVO, The Knocks & Alisa Ueno) - Single", "intro": "New York-based duo Sofi Tukker craft throbbing '90s house-inspired jungle pop that resulted in a Grammy nomination before they even released a full-length album. The pair -- Sophie Hawley-Weld and Tucker Halpern -- met in Providence, Rhode Island while attending Brown University. Soon after, the solo artists joined forces and composed their first song, \"Drinkee,\" which would become an international hit. Streamed over 30 million times and charting in multiple countries, \"Drinkee\" went on to receive a Grammy nomination in 2017. The track featured lyrics adapted from a Brazilian poem and was sung in Portuguese (which Hawley-Weld studied in college), adding to its global appeal. \"Drinkee\" appeared on the pair's 2016 debut EP, Soft Animals. The following year, the propulsive single \"Fuck They\" arrived. ~ Neil Z. Yeung"},
{"artist": "Demi Lovato", "artist_link": "https://itunes.apple.com/us/artist/demi-lovato/id280215821?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Features128/v4/a1/95/92/a19592f4-fbf7-149b-83bc-ba6a7df670d5/source/735x135sr.jpg", "origin": "Dallas, TX", "genre": "Pop", "born": "Aug 20, 1992", "latest_release": "\n      ", "intro": "Within a few short years, Demi Lovato went from a Disney starlet to a pop star with many hit singles to her credit, a judge position on the U.S. version of Simon Cowell's popular talent search show The X Factor, and a spokesperson for mental-health issues. Born in 1992 in Dallas, Texas, she was raised in a household that included her mother (a former Dallas Cowboys Cheerleader) and her two sisters, the youngest of whom launched her own acting career in 2008. Demi started out as a child actress, starring as a cast regular on Barney and Friends before finding her way onto the Disney Channel with a brief role in As the Bell Rings.Lovato's debut album, Don't Forget, featuring songs co-written by the Jonas Brothers, was released by Hollywood Records several months after the premiere of Camp Rock, a 2008 Disney Channel movie starring Lovato and the Jonas siblings. Don't Forget debuted at number two, confirming Lovato's status as a star in her own right, and was followed in 2009 by the chart-topping Here We Go Again. Meanwhile, Lovato continued to act, appearing in a popular sequel to Camp Rock and starring in her own Disney series, Sonny with a Chance.In 2010, following a widely reported altercation with a backup dancer, Lovato left a tour with the Jonas Brothers to enter a treatment center for unspecified physical and emotional problems. After leaving the facility in 2011, Lovato announced that she had been treated for bulimia, among other issues, and had been diagnosed with bipolar disorder. She also revealed that she would not be returning to work on Sonny with a Chance.In 2011, Lovato released the studio album Unbroken, featuring the Toby Gad-produced single \"Skyscraper.\" It became the biggest hit since her Camp Rock days, nesting at number ten on the Billboard Hot 100 and going platinum. The second single, \"Give Your Heart a Break,\" peaked slightly lower at number 16, but was a bigger seller, eventually certifying at three-times platinum in the U.S. alone. Unbroken also featured co-starring roles for Timbaland and Missy Elliott on \"All Night Long\" and Jason Derulo on \"Together.\"Lovato's comeback continued in 2012 when she, along with Britney Spears, signed on to be one of the four judges on the second season of the U.S. version of The X Factor. It debuted in the fall of 2012, and Lovato's role was a success, leading to her return for the 2013 season. Prior to the show's fall launch, Lovato released her fourth album, Demi, which appeared in May of 2013 -- preceded by the single \"Heart Attack,\" which peaked in the Top Ten. A pair of subsequent singles reached the Top 40: \"Neon Lights\" and \"Really Don't Care\" (the latter featuring Cher Lloyd). She hit the Top 40 yet again with a contribution to yet another Disney vehicle, this time a cover version of Idina Menzel's \"Let It Go\" that was released as the lead single for the massive hit Frozen. Lovato also entered the best-selling books chart, with Staying Strong: 365 Days a Year, a collection of her thoughts and quotes from those who inspired her during her struggles with addiction and depression. During 2014, she had a recurring role on the TV show Glee and headlined two world tours. The following July, Lovato released \"Cool for the Summer,\" the Max Martin and Wolf Cousins-produced lead single for her fifth studio album, Confident. The brassy title track was also issued as a single a few weeks before the album's October 2015 release. Other collaborators on the album included Iggy Azalea and songwriter Savan Kotecha, who also contributed to \"Cool for the Summer.\" In addition to a Grammy nomination, Confident peaked at number two on the Billboard 200. In 2017, Lovato contributed vocals to Cheat Codes' \"No Promises\" and Jax Jones' \"Instruction\" before releasing her own single, \"Sorry Not Sorry.\" It was the first single from her sixth full-length album, Tell Me You Love Me, which appeared in September 2017. ~ Matt Collar"},
{"artist": "Bruno Mars", "artist_link": "https://itunes.apple.com/us/artist/bruno-mars/id278873078?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Features62/v4/0c/37/d5/0c37d52a-8604-c13d-5b3c-02bdd2509be8/source/735x135sr.jpg", "origin": "Waikiki, HI", "genre": "Pop", "born": "Oct 8, 1985", "latest_release": "Versace On The Floor (Bruno Mars vs. David Guetta) - Single", "intro": "American singer/songwriter Bruno Mars is a Grammy-winning artist who got his start crafting hits for other artists before taking off on his own highly successful trajectory. An all-around entertainer, he also plays multiple instruments, produces, and choreographs. His path to mainstream success was lengthy. After he worked a string of behind-the-scenes jobs -- including writing songs for Brandy, singing backup for Sugababes, and impersonating Elvis Presley -- he put his name on top of the Billboard Hot 100 by co-writing Flo Rida and Kesha's \"Right Round.\" One year later, he collaborated with rapper B.o.B on \"Nothin' on You\" and co-wrote Travie McCoy's \"Billionaire,\" both of which became Top Ten hits. Mars used that momentum to launch a solo career and became the first male vocalist in two decades to crack the Top Ten with his first four singles. Born Peter Hernandez in Honolulu, Hawaii, Mars kicked off his career at the age of four by fronting his uncle's band, becoming Oahu's youngest Elvis impersonator in the process. Ten years later, he was impersonating the King of Pop, Michael Jackson, as part of the Legends in Concert show. After graduating high school in 2003, he took his uncle's advice and moved to California to pursue a music career. He eventually met songwriter Phillip Lawrence, who convinced Mars to try his hand at writing songs for other artists. The two dubbed themselves the Smeezingtons and co-wrote Brandy's \"Long Distance.\" The duo scored their first number one hit in 2009, when they co-authored Flo Rida's international smash \"Right Round.\" By 2010, Mars seemed to be everywhere: singing alongside B.o.B on the chart-topping \"Nothin' on You,\" co-writing \"Billionaire,\" and collaborating with Cee Lo Green on the Grammy-nominated hit \"F*ck You!\" He also began issuing his own material, starting with the May 2010 release of his first EP, It's Better If You Don't Understand. Doo-Wops & Hooligans, his full-length debut, appeared later that year and quickly produced a number one single, \"Just the Way You Are.\" He hit number one again with \"Grenade\" and remained in the Top Four with \"The Lazy Song\" and \"It Will Rain.\" In 2012, Mars both hosted and performed as a musical guest on Saturday Night Live, debuting tracks from his upcoming album.That album, the genre-jumping effort Unorthodox Jukebox, was released later in the year and featured the chart-topping single \"Locked Out of Heaven,\" along with production from Mark Ronson, Diplo, and others. \"Locked Out of Heaven\" topped the Hot 100, and the album reached number two in the U.S. The second single, \"When I Was Your Man,\" also hit number one. All that success made Mars a natural for one of the world's most prestigious gigs, the half-time show for Super Bowl XLVIII, where he performed with Red Hot Chili Peppers. Unorthodox Jukebox later won a Grammy Award for Best Pop Vocal Album. The following year, Mars fronted Mark Ronson's \"Uptown Funk,\" a song he co-wrote that was among the most popular singles of that year. It topped charts around the globe (becoming Mars' sixth number one) and took home several Grammy Awards, including Record of the Year. In 2016, Mars returned with another funk-flavored hit, \"24K Magic,\" and its parent album of the same title. Influenced by soul, funk, and '90s R&B, 24K Magic peaked at number two on the Billboard 200 and produced Mars' seventh chart-topper, \"That's What I Like,\" as well as \"Versace on the Floor,\" which was remixed by David Guetta. ~ David Jeffries & Andrew Leahey"},
{"artist": "Dustin Lynch", "artist_link": "https://itunes.apple.com/us/artist/dustin-lynch/id493220807?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Music111/v4/ee/21/f4/ee21f42a-a1e7-8500-b6c6-f72a8f339dff/source/146x146sr.jpg", "origin": "Nashville, TN", "genre": "Country", "born": "May 14, 1985", "latest_release": "Small Town Boy (Stripped) - Single", "intro": "Country music singer and songwriter Dustin Lynch was born and raised in Tullahoma, Tennessee, and grew up influenced by what he calls \"the class of '89,\" Alan Jackson, Garth Brooks, and Clint Black, all of whom had their first national success in 1989. Lynch moved to Nashville to attend college and to be closer to country music's epicenter in 2003, renting an apartment behind Nashville's Bluebird Café, famous as a testing and proving ground for young songwriters. Eventually Lynch earned a performance spot at the Bluebird, and he honed his skills, branching out to gig at other venues on the Southeast club circuit. His big break came in 2011 when he was discovered by Justin Moore's manager through Lynch's MySpace page, and it led to a management contract with L3 Entertainment, a publishing deal with Super 98/The Song Factory, and a record deal with Broken Bow Records. Broken Bow released Lynch's debut single, \"Cowboys and Angels,\" in 2012 and it went to number two on the Billboard country chart. Its accompanying album, Dustin Lynch, debuted at number one on the Billboard charts and generated another hit in \"She Cranks My Tractor.\" Lynch released his second album, Where It's At, in September 2014 and it produced three Top Ten hits: \"Where It's At (Yep, Yep),\" \"Hell of a Night,\" and \"Mind Reader.\" \"Seein' Red,\" the first single from his third album, showed up in the summer of 2016. A second single, \"Small Town Boy,\" followed in 2017 and peaked at number seven on Billboard's U.S. Hot Country Songs chart. Lynch's third album, Current Mood, arrived in September of that year, reaching number seven on Billboard's Top 200. ~ Steve Leggett"},
{"artist": "Justin Timberlake", "artist_link": "https://itunes.apple.com/us/artist/justin-timberlake/id398128?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Features7/v4/a6/b6/09/a6b609ca-b99f-49c1-71a9-10c8aadeb6d9/source/735x135sr.jpg", "origin": "Memphis, TN", "genre": "Pop", "born": "Jan 31, 1981", "latest_release": "The Book of Love (Original Motion Picture Soundtrack)", "intro": "Justin Timberlake may be the quintessential pop star of the new millennium, a star who jumped from platform to platform on his way to establishing himself as something bigger than a star: he was a self-sustained empire. Timberlake began his rise as a TV star, performing on The New Mickey Mouse Club as a child in the '90s, but he earned his superstardom as one of the frontmen for *NSYNC, the most popular boy band of the turn of the millennium. Justin stepped away from the band just as its popularity crested, releasing the sleek Justified in 2002, its hit singles \"Cry Me a River\" and \"Rock Your Body\" establishing him as a force outside the group, and he consolidated that success in 2006 with FutureSex/LoveSounds, the album that generated his biggest hit, \"SexyBack.\" After reaching this pop peak, he decided to pursue other ventures, choosing to concentrate on acting and entrepreneurship. Recurring appearances on Saturday Night Live proved to be among the show's most popular spots and he received acclaim for his performance in the 2010 Oscar-winning film The Social Network. After juggling numerous ventures outside the music industry, Timberlake returned to the top of the charts with help from Timbaland. Timberlake's journey to stardom began in Memphis, Tennessee, where he was born on January 31, 1981. He began performing early, appearing on the televised talent competition Star Search at the age of 11, singing under the name of Justin Randall. This was his first step into the big leagues, leading to him securing a spot on The New Mickey Mouse Club in 1993. This cast would prove to be filled with future stars; in addition to Timberlake there were the pop singers Britney Spears and Christina Aguilera, actor Ryan Gosling, and JC Chasez, who'd later join Justin in *NSYNC, the group manager Lou Pearlman assembled in the late '90s. Pearlman formed *NSYNC after the cancellation of The New Mickey Mouse Club in 1994, taking Timberlake and Chasez as his anchors and adding Joey Fatone, Lance Bass, and Chris Kirkpatrick.*NSYNC began their march toward stardom in 1996 when their first album appeared in Europe. Two years later, their eponymous debut was released in the U.S. and the group scored hits with \"Tearin' Up My Heart,\" \"I Want You Back,\" and \"(God Must Have Spent) A Little More Time on You.\" The latter reached the Top Ten, paving the way for the smash success of No Strings Attached in 2000. Within one week of its March 2000 release, the album sold an astonishing 2.4 million copies and set a record that stood for 15 years. After generating the singles \"It's Gonna Be Me\" and \"Bye Bye Bye,\" the group set to work on its next album, 2001's Celebrity. It was another massive hit, launching the Top Ten singles \"Pop,\" \"Gone,\" and \"Girlfriend, but it proved to be the group's last album, as Timberlake's popularity was quickly eclipsing that of the rest of the group.It didn't take long for Justin to release his first solo album. Justified appeared a little over a year after Celebrity and its gleaming, stylish surfaces -- partially produced by the Neptunes and partially produced by Timbaland -- suggested a new, mature, adventurous musician who was as much an R&B vocalist as he was a pop singer. Timberlake supported the album with a co-headlining tour with Christina Aguilera in 2003 and he ruled the airwaves with the singles \"Like I Love You,\" \"Cry Me a River,\" Señorita,\" and \"Rock Your Body,\" not to mention the \"I'm Lovin' It\" jingle for McDonalds. He weathered a scandal in early 2004 when he tore off part of Janet Jackson's costume during their half-time duet at Super Bowl XXXVIII, but he bounced back nicely, winning Grammys that year for Justified and \"Cry Me a River.\" He also launched William Rast, a clothing line.As he worked on his second album with producer Timbaland, Timberlake found time to resume his acting career, taking on key roles in Southland Tales, Black Snake Moan, and Alpha Dog. Before any of these films appeared, his second album, FutureSex/LoveSounds, was released, preceded by the single \"SexyBack,\" a cool synthesized groove in the vein of Prince that established the tone for the album. \"SexyBack\" stayed at number one for seven weeks and its two sequels, \"My Love\" and \"What Goes Around.../...Comes Around Interlude,\" also reached number one over the following year, a year that also saw Justin launch an international tour in support of the album.Following the completion of the FutureSex/LoveSounds tour, Timberlake slowly stepped away from music, though he was featured on three major 2007-2008 pop hits: Timbaland's \"Give It to Me\" (number one), 50 Cent's \"Ayo Technology\" (number five), and Madonna's \"4 Minutes\" (number three). He had other musical endeavors over the next few years, but his main focus was acting. In 2007 he had a voice role in Shrek 3, and in 2008 had a lead part in Mike Myers' The Love Guru. Two years later, Timberlake had his greatest acting success as Sean Parker in David Fincher's The Social Network; he quickly followed this with roles in Bad Teacher and Friends with Benefits. During this period, he also appeared several times on Saturday Night Live.In January 2013, after investing in three Los Angeles and New York restaurants, he released a new single, \"Suit & Tie,\" co-produced with Timbaland. Along with a glitzy performance at the 2013 Grammy Awards and another SNL appearance, it set the stage for The 20/20 Experience, released that March. It debuted at number one on the Billboard 200 and eventually went double platinum, driven by Top Five showings for its singles, \"Suit & Tie\" and \"Mirrors.\" Two months later, the Coen Brothers film Inside Llewyn Davis, in which he co-starred, premiered at the 2013 Cannes Film Festival and won the Grand Prix. Part two of The 20/20 Experience, recorded during the same session that resulted in the first, was released that September. It followed the first to the top of the charts, and produced three Top 40 singles, \"Take Back the Night,\" \"TKO,\" and \"Not a Bad Thing.\" In 2014, Timberlake returned to the Top Ten as a featured guest on \"Love Never Felt So Good,\" a track from Michael Jackson's posthumous album Xscape. \"Can't Stop the Feeling!,\" recorded for the soundtrack of Trolls (a DreamWorks production in which Timberlake provided one of the lead voices), topped the pop chart months ahead of the film's 2016 theatrical release. Timberlake also co-composed the soundtrack for The Book of Love, a film co-produced and co-starring his wife Jessica Biel, released later that year. ~ Stephen Thomas Erlewine"},
{"artist": "Mariah Carey", "artist_link": "https://itunes.apple.com/us/artist/mariah-carey/id91853?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Features7/v4/19/bb/44/19bb44f1-51e4-8869-83a8-8564be21988e/source/735x135sr.jpg", "origin": "Huntington, NY", "genre": "Pop", "born": "Mar 27, 1970", "latest_release": "I Don't (feat. Remy Ma & YG) [Remix] - Single", "intro": "The best-selling female performer of the 1990s and one of the most popular artists through the 2010s, Mariah Carey rose to superstardom on the strength of her stunning five-octave voice. An elastic talent who moved easily from glossy ballads to hip-hop-inspired dance-pop, she earned frequent comparison to rivals Whitney Houston and Celine Dion, but did them both one better by co-writing almost all her material. Like all artists with lengthy periods in the mainstream spotlight, Carey experienced creative and commercial lulls, yet each one of her proper studio albums peaked within the Top Five of the Billboard 200. Born in Long Island, New York, on March 27, 1970, Carey moved to New York City at the age of 17 -- just one day after graduating high school -- to pursue a music career; there she befriended keyboardist Ben Margulies, with whom she began writing songs. Her big break came as a backing vocalist on a studio session with dance-pop singer Brenda K. Starr, who handed Carey's demo tape to Columbia Records head Tommy Mottola at a party. According to legend, Mottola listened to the tape in his limo while driving home that same evening, and was so immediately struck by Carey's talent that he doubled back to the party to track her down. After signing to Columbia, Carey entered the studio to begin work on her 1990 self-titled debut LP. The heavily promoted album was a chart-topping smash, launching no less than four number one singles: \"Vision of Love,\" \"Love Takes Time,\" \"Someday,\" and \"I Don't Wanna Cry.\" Her overnight success earned Grammy Awards as Best New Artist and Best Female Vocalist, and expectations were high for Carey's follow-up, 1991's Emotions. The album did not disappoint, as the title track reached number one -- a record fifth consecutive chart-topper -- while both \"Can't Let Go\" and \"Make It Happen\" landed in the Top Five. Carey's next release was 1992's MTV Unplugged EP, which generated a number one cover of the Jackson 5's \"I'll Be There.\" Featured on the track was backup singer Trey Lorenz, whose appearance immediately helped him land a recording contract of his own. In June 1993, Carey wed Mottola -- some two decades her senior -- in a headline-grabbing ceremony; months later, she released her third full-length effort, Music Box, which became her best-selling record to date. Two more singles, \"Dreamlover\" and \"Hero,\" reached the top spot on the charts. Carey's first tour followed and was widely panned by critics; undaunted, she resurfaced in 1994 with a holiday release titled Merry Christmas, scoring a seasonal smash with \"All I Want for Christmas Is You.\" Released in 1995, Daydream reflected a new artistic maturity; the first single, \"Fantasy,\" debuted at number one, making Carey the first female artist and just the second performer ever to accomplish the feat. The follow-up, \"One Sweet Day\" -- a collaboration with Boyz II Men -- repeated the trick, and remained lodged at the top of the charts for a record 16 weeks. After separating from Mottola, Carey returned in 1997 with Butterfly, another staggering success and her most hip-hop-flavored recording to date. #1's -- a collection featuring her 13 previous chart-topping singles as well as \"The Prince of Egypt (When You Believe),\" a duet with Whitney Houston effectively pairing the two most successful female recording artists in pop history -- followed late the next year. With \"Heartbreaker,\" the first single from her 1999 album Rainbow, Carey became the first artist to top the charts in each year of the 1990s; the record also pushed her ahead of the Beatles as the artist with the most cumulative weeks spent atop the Hot 100 singles chart.However, the early 2000s weren't as kind to Carey. After signing an $80 million deal in 2001 with Virgin -- the biggest record contract ever -- she starred in her first film, Glitter and its attendant soundtrack (which was also her Virgin Records debut). Despite the movie's soft ticket sales, the Glitter soundtrack eventually went platinum thanks to the single \"Loverboy.\" Virgin and Carey parted ways early in 2002, with the label paying her $28 million. That spring, she found a new home with Island/Def Jam, where she set up her own label, MonarC Music. In December, she released her ninth album, Charmbracelet, her first proper studio album to go merely platinum rather than multi-platinum.The Emancipation of Mimi, her most successful work in years, appeared in 2005. It climbed to multi-platinum status and earned Carey three Grammy Awards -- Best Contemporary R&B Album and, for the single \"We Belong Together,\" Best Female R&B Vocal Performance and Best R&B Song -- thus restoring her status as a megastar. Two weeks before the release of her subsequent album, 2008's E=MC2, Carey scored her 18th number one hit with \"Touch My Body,\" a feat that pushed her into second place (past Elvis, no less) among all artists with the most chart-topping singles. Although that hit song, along with the late April news that she had married Nick Cannon, kept her in the spotlight that year, the remainder of the album's spinoffs weren't nearly as successful; only \"Bye Bye\" managed to scrape the Top 20 of the Billboard Hot 100.Carey went back to work fairly quickly, however, and in 2009, Memoirs of an Imperfect Angel -- featuring collaborations with the-Dream as well as a cover of Foreigner's \"I Want to Know What Love Is\" -- became her 12th studio album. Despite some positive reviews, it was her least successful studio album; only one of its singles, \"Obsessed,\" reached the Top Ten. The following year, Carey released her second Christmas album, Merry Christmas II You. She gave birth to twins in 2011, and within a year she was performing again and judged the 12th season of American Idol. The Miguel collaboration \"#Beautiful,\" the lead single to her next album, was released in 2013 and went platinum. Me. I Am Mariah: The Elusive Chanteuse, her first album for Def Jam, followed in 2014, and reached number two on the album charts. ~ Jason Ankeny"},
{"artist": "Chris Young", "artist_link": "https://itunes.apple.com/us/artist/chris-young/id4779205?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Music118/v4/9e/70/9c/9e709c8f-5db4-11fe-aae6-b9087df1b670/source/146x146sr.jpg", "origin": "Murfreesboro, TN", "genre": "Country", "born": "Jun 12, 1985", "latest_release": "Losing Sleep", "intro": "The grandson of onetime Louisiana Hayride performer Richard Yates, country singer/songwriter Chris Young hails from Murfreesboro, Tennessee, and first drew the public's attention when he appeared on the Nashville Star television show in 2006. Young's singing abilities first surfaced in children's theater productions in grade school, and with his family's full support, he threw himself into learning all he could about music, and country music in particular. By the time he was a senior in high school he was already playing clubs in the Nashville area, and his self-released debut album was out before he even graduated from high school. Young attended college at Belmont University in Nashville and then Middle Tennessee State University in Murfreesboro, all while still managing to do some 150 live shows a year. He was offered and accepted a gig fronting the house band at Cowboy's in Arlington, Texas, and it was there that a fan kept insisting that he audition for the Nashville Star TV show. Young eventually made the trip to Houston and passed the audition, and the whole affair paid off handsomely with a contract from RCA Records. Young's debut single, \"Drinkin' Me Lonely,\" a song he wrote with Larry Wayne Clark, was released in 2006, followed later in the year by a Buddy Cannon-produced album called simply Chris Young. A second album, The Man I Want to Be, produced by James Stroud, appeared in 2009. Young's third album, 2011's Neon, may not have gone gold -- The Man I Want to Be had -- but it did have \"Tomorrow,\" a heart-wrenching ballad that was his biggest hit to date, reaching number one on the Billboard country charts and cracking the pop Top 40 on its way to going platinum. \"You,\" the second single from Neon, also went to number one on the country charts, and two other hits followed: \"Neon\" and \"I Can Take It from There.\" Young delivered his brighter, happier third album, A.M., in the fall of 2013; it was preceded by the party anthem \"Aw Naw,\" which peaked at 16 on the Billboard charts. A.M. produced two further country Top Ten hits with the softer \"Who I Am with You\" and \"Lonely Eyes,\" singles that appeared on the charts in 2014. Young returned in the fall of 2015 with \"I'm Comin' Over,\" another Top Ten hit that was also the title track to his fifth album, which saw release in November of that year. \"Think of You,\" a duet with Cassadee Pope, followed \"I'm Comin' Over\" to number two on Billboard's U.S. Hot Country chart, while the Vince Gill duet \"Sober Saturday Night\" went to number 31 later that year. In the holiday season of 2016, Young released It Must Be Christmas; it peaked at four on Billboard's Country Albums chart. Young released his sixth album of originals, Losing Sleep, in October 2017. ~ Steve Leggett"},
{"artist": "Luis Fonsi & Daddy Yankee", "artist_link": "https://itunes.apple.com/us/artist/luis-fonsi/id102834?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music128/v4/bd/cd/21/bdcd2174-090e-4316-9d51-5bc8e953b106/source/146x146sr.jpg", "origin": "San Juan, Puerto Rico", "genre": "Pop Latino", "born": "Apr 15, 1978", "latest_release": "Party Animal - Single", "intro": "Initially molded as a traditional Latin balladeer, one who sings romantic songs with much dramatic flair over sweeping string arrangements, Luis Fonsi enjoyed much success as such, though he began to break steadily from that mold, beginning with Paso a Paso in 2005, and enjoyed even greater success and more critical acclaim as a result. Born in Puerto Rico and raised in Orlando, Florida, Fonsi dove into show business at a young age, singing in a school vocal group called the Big Guys that also included future *NSYNC star Joey Fatone. Following high school, Fonsi studied singing at Florida State University and scored a contract offer from Universal Latino. He debuted on Universal in 1998 with Comenzare, which did well, peaking at number 27 on Billboard's Top Latin Albums chart and spawning four hit singles: \"Si Tu Quisieras,\" \"Perdóname,\" \"Dime Como,\" and \"Me Iré.\" His follow-up album, Eterno, released in 2000, did even better, peaking at number six on the Top Latin Albums chart and spawning another four hit singles, among them the chart-topping \"Imaginame Sin Ti.\" And so it went for the next few years, with more releases and more commercial success. Amor Secreto topped the Latin album chart in 2002 and Abrazar la Vida came close in 2003, both of them carried by numerous hits. The only mishap for Fonsi during this remarkable run was an English-language crossover attempt, Fight the Feeling, that came and went very quickly in 2002, a clear miscalculation. When time came for Fonsi to record his sixth album, to be released in 2005, he went out on a limb, recruiting producer Sebastian Krys, who had previously worked with the likes of Carlos Vives, Obie Bermúdez, and JD Natasha. The resulting album, Paso a Paso, was still a Latin pop excursion through and through, but in general, it featured guitars in the forefront rather than sweeping strings. It also explored different kinds of rhythms and arrangements, resulting in Fonsi's most distinct and creative album to date. Critics, who hadn't always been kind to Fonsi, were mostly positive and liked what they heard. Moreover, and more importantly, the public loved the lead single, \"Nada Es Para Siempre,\" and lined up in droves to buy the album when it was released in late summer. Paso a Paso debuted at number two on the Top Latin Albums chart, setting up yet another great run for Fonsi, who now found himself more aligned with successful yet inventive Latin stars like Juanes than the generic balladeers he had previously kept company with. His 2008 effort, Palabras del Silencio, was essentially a continuation of all that Fonsi accomplished with Paso a Paso, with the singer co-writing all of the 13 songs. The album earned double-platinum status in the U.S. and Venezuela, along with gold status in Spain, Mexico, Colombia, and Central America. Featuring the hit single \"Gritar,\" the album Tierra Firme followed in 2011. Three years later, Fonsi returned with his eighth album, appropriately titled 8, and followed it with a lengthy tour. In a stylistic turn, he collaborated with Puerto Rican rapper/singer Daddy Yankee on the reggaeton-influenced single \"Despacito,\" which rose high on the charts upon its January 2017 release. Fonsi announced that a new album with a more modern pop sound would be released later that year. ~ Jason Birchmeier"},
{"artist": "Hailee Steinfeld & Alesso", "artist_link": "https://itunes.apple.com/us/artist/hailee-steinfeld/id417571723?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Music62/v4/d0/0e/3b/d00e3b9e-25c4-1caf-5954-c0c411e281e7/source/146x146sr.jpg", "origin": "Tarzana, CA", "genre": "Pop", "born": "Dec 11, 1996", "latest_release": "Let Me Go (feat. Florida Georgia Line & watt) - Single", "intro": "A child actress who had her breakthrough role at age 13 in the Coen Brothers' True Grit (2010), a performance that earned her an Academy Award nomination for Best Supporting Actress, Hailee Steinfeld is also a charting pop singer whose vocal talent was featured in the film musical Pitch Perfect 2 (2015). Born in Tarzana, California and raised in Thousand Oaks, Steinfeld acted in several television commercials, TV show episodes, and short films as a child before her feature film debut in True Grit. That role led to screen appearances with the likes of Harrison Ford, Jessica Alba, Kristen Wiig, Anna Kendrick, and Kevin Costner while still in her teens. In 2015, she was also featured in the music video for Taylor Swift's number one hit \"Bad Blood\" and on an acoustic version of Shawn Mendes' hit \"Stitches.\" Her own pop single, the rousing \"Love Myself,\" hit the Hot 100 that summer in addition to being a streaming and radio hit. Her debut EP, Haiz, arrived in November 2015 and included her second single, \"Rock Bottom.\" The following July, she returned with \"Starving,\" a collaboration with the EDM duo Grey and producer Zedd. \"Most Girls\" arrived in the spring of 2017. ~ Marcy Donelson"},
{"artist": "Devin Dawson", "artist_link": "https://itunes.apple.com/us/artist/devin-dawson/id965280208?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music111/v4/a8/52/56/a8525603-bfda-6bb4-eac2-810be75c08d0/source/146x146sr.jpg", "origin": "Orangevale, CA", "genre": "Country", "born": "1989", "latest_release": "Dark Horse", "intro": "Devin Dawson is a country singer and songwriter with a keen ear for clever turns of phrase and a knack for splitting the difference between rootsy and contemporary. A native of Orangevale, California, Dawson spent his formative years soaking in the sounds of Creedence Clearwater Revival, Alan Jackson, Marvin Gaye, and Johnny Cash. In 2012 he packed his bags and headed to Nashville, where he became ensconced in the Music City songwriting machine, penning songs for other artists. After spending a few years honing his chops, he decided to strike out on his own, and enlisted the help of producer Jay Joyce (Eric Church, Little Big Town, Brothers Osborne). He inked a deal with Warner Music Nashville and released his debut single, \"All on Me,\" in 2017, with plans to release a full-length later in the year. ~ James Christopher Monger"},
{"artist": "Post Malone", "artist_link": "https://itunes.apple.com/us/artist/post-malone/id966309175?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Music118/v4/09/ab/7b/09ab7b94-1523-e151-aa1c-e61e8b71d3d3/source/146x146sr.jpg", "origin": "Syracuse, NY", "genre": "Hip-Hop/Rap", "born": "Jul 4, 1995", "latest_release": "rockstar (feat. 21 Savage) - Single", "intro": "Dropping basketball references like the old-school but wrapping them in thoroughly modern beats, Post Malone hit in 2015 with his single \"White Iverson.\" Raised in Dallas, Malone was NFL before he was NBA thanks to a father who worked for the Cowboys. He loved music from a young age, and planned on joining a band thanks to the video game Guitar Hero, but when his dad gave him a copy of Terror Squad's hit \"Lean Back,\" Post decided to become an MC. He hung with Dallas crew the IRAS until a move to the West Coast dropped him in Los Angeles. After putting some braids in his hair, he coined the term \"White Iverson,\" and when he posted the track in early 2015, he hit a million views within the month. Malone signed with the Republic label later that year. In 2016, he released the single \"Go Flex\" along with his official debut mixtape, August 26th, which was actually released in May. Months later, his first studio effort arrived. Stoney featured guests like Justin Bieber, Migos' Quavo, and Kehlani. The album peaked at number six on the Billboard 200 and was certified platinum. ~ David Jeffries"},
{"artist": "Kygo", "artist_link": "https://itunes.apple.com/us/artist/kygo/id635806094?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Features1/v4/0a/83/56/0a835626-bebf-e6b3-d90e-2a2b0b32a346/source/735x135sr.jpg", "origin": "Bergen, Norway", "genre": "Dance", "born": "Sep 11, 1991", "latest_release": "Kids in Love", "intro": "Kygo (born Kyrre Gørvell-Dahll in Bergen, Norway) broke through with a sound termed \"tropical house\" that tended to be brighter and more relaxed than that of his commercial dance music contemporaries. In 2013, the Avicii-inspired producer and DJ reached number one on Norway's VG-lista chart with his slow-galloping remix of Seinabo Sey's \"Younger.\" He gained additional attention through remixes of Marvin Gaye's \"Sexual Healing\" and Ed Sheeran's \"I See Fire.\" Signed to an international deal with Sony that placed him on RCA in the U.S. and on Syco in the U.K., he released his first proper single, \"Firestone,\" in 2014. Featuring a lead vocal from Conrad Sewell, the song not only went to number one in Norway but reached the Top Ten in several other territories. The following year, the Parson James collaboration \"Stole the Show\" was Kygo's second consecutive solo number one hit in Norway. Later that year, \"Nothing Left,\" featuring Will Heard, became his third Norwegian chart-topper. These hits, along with additional singles that featured Labrinth, Kodaline, and James Vincent McMorrow, preceded his debut full-length LP, Cloud Nine, which was released in May 2016 and quickly went to number one in Norway. That month, two tracks he produced with Stargate appeared on Fifth Harmony's 7/27. In February 2017, Kygo released \"It Ain't Me,\" a collaboration with American singer Selena Gomez that reached number ten on the Billboard pop chart. \"First Time,\" another collaboration, this time with British singer Ellie Goulding, quickly followed. Both tracks went on to appear on 2017's Stargazing EP. The release also featured a remix of the U2 song \"You're the Best Thing About Me.\" Later that year, Kygo issued his sophomore follow-up LP, Kids in Love. The album featured guests like John Newman (\"Never Let You Go\"), OneRepublic (\"Stranger Things\"), and Wrabel (\"With You\"). ~ Andy Kellman"},
{"artist": "NF", "artist_link": "https://itunes.apple.com/us/artist/nf/id898094630?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is3-ssl.mzstatic.com/image/thumb/Music118/v4/37/67/e9/3767e9d4-300b-64fc-827e-872e10347c85/source/146x146sr.jpg", "origin": "Gladwin, MI", "genre": "Hip-Hop/Rap", "born": "", "latest_release": "Perception", "intro": "NF is the stage name of rapper and composer Nate Feuerstein from Gladwin, Michigan. Feuerstein endured a hardship-filled childhood in which his parents divorced, his mother's boyfriend physically abused him, and his mother eventually killed herself. Music was his escape, and he began recording songs on a karaoke machine, with instrumentals on one microphone and his raps in the other. Placing second in a nationwide Fine Arts Festival rap competition in 2008, and first in Michigan the following year, he independently released a debut album, Moments, in 2010. The album attracted the attention of Xist Music, which signed him to a recording deal in 2012, by which time Feuerstein had taken on the stage name NF. The label announced the release of an EP that same year, but it never appeared, and NF and Xist parted ways. NF spent the next two years looking for a label and working with local producer Tommee Profitt in his studio; they came up with the song \"Wake Up,\" which convinced Capitol Christian Music Group to sign him. CMG released a six-song (including a Manny Marroquin remix of \"Wake Up\") self-titled EP late in the summer of 2014. His debut album, Mansion, was released in early 2015 and reached number 62 on the Billboard 200 while topping the Christian Albums chart. The aptly titled Therapy Session followed in 2016 and also topped the Christian Albums chart with its raw emotions and honest lyrics. The following Summer saw the release of the singles \"Outro\" and \"Green Lights\", in anticipation of the arrival of his third studio long player, Perception, whch dropped later that October. ~ Steve Leggett"},
{"artist": "Russell Dickerson", "artist_link": "https://itunes.apple.com/us/artist/russell-dickerson/id415673786?l=en&ign-mpt=uo%3D4", "artist_pic_link": null, "origin": "", "genre": "Country", "born": "", "latest_release": "Yours", "intro": "Belonging to a class of country singers who slyly incorporate modern R&B rhythms into their bright, tuneful mainstream country-pop -- a class that also features Sam Hunt and Thomas Rhett -- Russell Dickerson first started to gain traction in late 2015 with the single \"Yours.\" As a native of Nashville, Dickerson grew up in the thick of Music City and by the time he hit college, he knew he wanted to pursue music professionally. He completed a degree in music at Belmont University and in 2010 scored representation with Creative Artists Agency, who helped him land a publishing deal in addition to repping him as a performer. Dickerson's first attempt at a solo career -- 2011's \"That's My Girl\" -- didn't go anywhere, but in 2013 \"Green Light\" became a hit on satellite radio. Over the next couple of years, Dickerson's music became poppier, a makeover that paid off once \"Yours\" became a country radio hit in late 2015, leading to the release of the Yours EP in 2016. The EP was expanded into a full-length album the following year. ~ Stephen Thomas Erlewine"},
{"artist": "The Chainsmokers & Coldplay", "artist_link": "https://itunes.apple.com/us/artist/the-chainsmokers/id580391756?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Features49/v4/eb/d1/7c/ebd17c6b-2da0-88fc-5b43-94de3747ecf3/source/735x135sr.jpg", "origin": "New York, NY", "genre": "Dance", "born": "2012", "latest_release": "\n      ", "intro": "A production duo featuring Andrew Taggart and Alex Pall, the Chainsmokers mix indie, dance, and pop into a chart-topping sound that spawned hits like \"Roses,\" \"Closer,\" and \"Don't Let Me Down.\" Pall and Taggart first made a name for themselves by creating remixes of their favorite indie bands that garnered tens of millions of streams. The duo released its official debut single, \"#Selfie,\" which celebrated and skewered 2010s narcissism, in January 2014. The track's bouncy beats and self-obsessed words hit number one on the Billboard dance chart and sold over ten million copies. Meanwhile, \"#Selfie\"'s video featured cameos by Snoop Dogg and David Hasselhoff, fueling the song's viral popularity to hundreds of millions of views. More singles, including \"Kanye\" and \"Let You Go,\" followed. In 2015, they issued the Bouquet EP on Disruptor Records, a softer and more indie-flavored effort that featured the single \"Roses,\" which was certified double-platinum and hit number one on the Top Dance Songs chart. The song also earned the Chainsmokers nominations for the Billboard Music Awards in the Top Dance/Electronic Artist and Top Dance/Electronic Song categories. After playing over 300 shows in 2015, including dates at festivals like Lollapalooza, Firefly, Tomorrowland, and Ultra, the duo returned in 2016 with the platinum-certified \"Don't Let Me Down,\" a collaboration with Pittsburgh pop singer Daya that topped the Billboard dance chart and would later win a Grammy. That year, the Chainsmokers also performed as part of the Tilt Tour, the first ever fan-sourced tour. In addition, Pall and Taggart host two SiriusXM shows: Nice Hair, a monthly mix; and the weekly YouTube EDM 15. The follow-up single to \"Don't Let Me Down\" would carry the duo to new heights. Featuring Halsey on vocals, \"Closer\" began its slow climb to the top of the singles chart in the summer of 2016. Once it hit number one, it remained in the top spot for over ten weeks, breaking the record previously held by Drake's \"One Dance.\" As their chart dominance continued, they released the Collage EP, which joined their two Top Three singles with new collaborations featuring Phoebe Ryan, XYLØ, and Charlee. Their debut record, Memories: Do Not Open, arrived in 2017, preceded by the hit singles \"Paris\" and the Coldplay duet \"Something Just Like This.\" Memories debuted at the top of the Billboard chart. ~ Heather Phares"},
{"artist": "Lee Brice", "artist_link": "https://itunes.apple.com/us/artist/lee-brice/id216359623?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Music5/v4/05/da/20/05da20fb-f386-ad32-ea12-58b2c85f0069/source/146x146sr.jpg", "origin": "Sumter, SC", "genre": "Country", "born": "Jun 10, 1979", "latest_release": "Lee Brice", "intro": "At the dawn of the 2010s, a time when mainstream country teemed with buff hunks singing party-hearty anthems, Lee Brice offered a subtler alternative. Also raised on a combination of contemporary rock and post-Garth Brooks country, Brice gravitated toward craft, not bluster. He wasn't adverse to good times -- he had a country hit in 2013 called \"Parking Lot Party\" -- but he specialized in heart-on-sleeve ballads like \"A Woman Like You,\" \"Hard to Love,\" \"I Drive Your Truck,\" and \"I Don't Dance,\" Top Ten country singles that showcased his supple, weathered voice and skilled song structure. The latter is what first brought him attention in Nashville -- he penned songs for Jason Aldean, Tim McGraw, and his idol Brooks -- but the former is what turned him into a star in the early years of the 2010s.By that point, Brice had been toiling away at a career for the better part of a decade. A native of Sumter, South Carolina, he learned how to sing at church and when he was seven, he began playing piano. Next came the guitar, and by the age of ten he had started writing his own songs, partially under the influence of his father's favorite artists, the Oak Ridge Boys and Alabama. The performing bug bit him in high school, where he won the school's talent contest for three straight years, and he started to expand his horizons, spending time listening to rock & roll but settling on Garth Brooks as his idol. In addition to music, Brice played football. He earned a scholarship to Clemson University, but once he suffered an arm injury he decided to devote himself to music. On the advice of Doug Johnson, Brice moved to Nashville, where Johnson would later sign the fledgling songwriter to a publishing contract as soon as he became an A&R man at Curb Records. Brice began placing songs with major-league artists, starting with a tune for the rock band Sister Hazel in 2006, which led to Jason Aldean recording \"Not Every Man Lives\" for his 2007 album Relentless, and Garth Brooks cutting \"More Than a Memory\" for a bonus track on 2007's The Ultimate Hits.Things were beginning to break Brice's way behind the scenes but he was having a harder time in front of the microphone. In 2007, he signed with Curb as a recording artist and cut an album called Picture of Me but none of the released singles -- \"She Ain't Right,\" \"Happy Endings,\" and \"Upper Middle Class White Trash\" -- made waves on the charts. He spent 2008 writing professionally as he retooled his own music, re-emerging in 2009 with \"Love Like Crazy.\" He had finally hit the right formula: the single stayed on the charts for over a year, eventually reaching number three on the Billboard country chart on its way to platinum certification. An album, also called Love Like Crazy, showed up in June 2010 and while it wasn't a smash, the hit single laid down the foundation for a successful career. Brice returned in late 2011 with \"A Woman Like You,\" the first single from 2012's Hard 2 Love. \"A Woman Like You\" became his first number one single and opened the door for the success of Hard 2 Love, which went gold on the strength of the Top Ten country singles \"Hard to Love\" and \"I Drive Your Truck,\" as well as the gold single \"Parking Lot Party\" which peaked at 11.With this success under his belt, Brice returned with his third album, the self-produced I Don't Dance, in 2014. It was preceded by the title track, which became a Top Ten country single in the summer of 2014, whetting the appetite for the record's September release. Upon its release, I Don't Dance debuted at number one on the Billboard country chart and five on the Top 200. \"Drinking Class\" and \"That Don't Sound Like You\" remained on the charts into 2015; that summer, Brice released the EP Mixtape: 'Til Summer's Gone. Brice spent 2016 working on new music, returning in the summer of 2017 with the single \"Boy.\" ~ Stephen Thomas Erlewine"},
{"artist": "Chris Stapleton", "artist_link": "https://itunes.apple.com/us/artist/chris-stapleton/id1752134?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Music22/v4/14/15/70/141570c7-5cad-791f-1dd4-e4e297d294c6/source/146x146sr.jpg", "origin": "Staffordsville, KY", "genre": "Country", "born": "Apr 15, 1978", "latest_release": "From A Room: Volume 2", "intro": "Chris Stapleton appeared to be one of those storybook overnight sensations: a troubadour who came out of nowhere to become a major star in the autumn of 2015 on the strength of his debut album Traveller. Like most overnight sensations, Stapleton had a long, hard road behind him. He had been laboring behind in the scenes in Nashville for years, leading the progressive bluegrass group the SteelDrivers and working as a professional songwriter, scoring hits with George Strait (\"Love's Gonna Make It Alright\"), Kenny Chesney (\"Never Wanted Nothing More\"), Luke Bryan (\"Drink a Beer\"), and Darius Rucker (\"Come Back Song\"). These tunes just scratched the surface of Stapleton's résumé: Brad Paisley, Luke Bryan, Dierks Bentley, and Tim McGraw all recorded his songs, as did Adele, who cut \"If It Hadn't Been for Love\" as a bonus track for her 2011 smash 21. All these covers signaled a deep reservoir of goodwill within the industry for the songwriter, and this goodwill bubbled to the surface in the fall of 2015, when he took home three major awards at the Country Music Association Awards: Best Male Vocalist, Album of the Year, and New Artist of the Year. All these awards boosted his visibility, leading to four Grammy nominations, including Album of the Year, and his first major hit, \"Nobody to Blame.\"It was success that was a long time coming. A native of Kentucky -- he was born in Lexington and raised in the smaller Staffordsville -- he moved to Nashville in 2001 in hopes of making it in country music. He signed a publishing deal with Sea Gayle Music and started to work steadily, writing songs and paying bills through various jobs, and playing music all the while. In 2008, he formed the SteelDrivers, a bluegrass group that received quite a bit of acclaim over the next two years. In 2009, the group was named Emerging Artist of the Year by the International Bluegrass Music Association, and the following year they received three Grammy nominations, including Best Bluegrass Album, for Reckless. Despite this success, Stapleton left the group in April 2010 and formed the Jompson Brothers with guitarist Greg McKee, bassist J.T. Cure, and drummer Brad McNamee. By 2013, the Southern rock band was no more, and Stapleton signed with Mercury Nashville, releasing \"What Are You Listening To?\" in October of that year. The single didn't go anywhere, so its accompanying album was scrapped, and he recorded a new record with co-producer Dave Cobb. This is the album that became Traveller, his solo debut.Traveller appeared in May 2015 to strong reviews but it didn't do much on country radio; in fact, it was overshadowed by the chart-topping \"Crash and Burn,\" a song Stapleton wrote with Jesse Frasure that was turned into a hit by Thomas Rhett. Nevertheless, its warm reception by critics and peers meant that it racked up a number of CMA nominations and, in a surprise to most observers, it took home three awards that December: Best Male Vocalist, New Artist of the Year, and Album of the Year. Suddenly, Stapleton was a hot property, receiving four Grammy nominations a few weeks after the CMAs, and soon, all that acclaim turned into sales, with Traveller reaching number one on the U.S. country charts and receiving a Gold certification from the RIAA, while \"Nobody to Blame\" became his first country radio hit. \"Parachute\" charted even higher later in 2016 and Stapleton spent the rest of that year working on his second album with producer Dave Cobb. Recorded at Nashville's RCA Studio A, From a Room was divided into two parts, with the first arriving in May 2017 and the second following in December 2017. ~ Stephen Thomas Erlewine"},
{"artist": "Marshmello", "artist_link": "https://itunes.apple.com/us/artist/marshmello/id980795202?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Features71/v4/bd/6b/90/bd6b9020-ce29-caf1-80fe-5189967bc2de/source/735x135sr.jpg", "origin": "", "genre": "Dance", "born": "2015", "latest_release": "Wolves - Single", "intro": "Enigmatic masked DJ/producer Marshmello makes groove-oriented, synth- and bass-heavy electronic dance music. In the spirit of other masked DJs like Deadmau5 and Daft Punk, Marshmello (whose real identity remains a mystery) appears wearing a full-head-covering marshmallow mask. Despite the anonymity, Marshmello's career blew up in 2015 when he began releasing tracks online, including remixes of Zedd's \"Beautiful Now,\" Jack Ü's \"Where Are U Now,\" and others. From there came shows at New York's Pier 94, Pomona, California's HARD Day of the Dead festival, and Miami Music Week. In 2016, Marshmello released a compilation of his previously released tracks, Joytime, which reached number one on a digital top electronic albums chart. Included on the album was the single \"Keep It Mello,\" featuring rapper Omar LinX. He continued to perform and release singles throughout the year, later starting his own Joytime Collective record label. In 2017, Marshmello released collaborations with Ookay, Noah Cyrus, Khalid, and Blackbear. ~ Matt Collar"},
{"artist": "Macklemore", "artist_link": "https://itunes.apple.com/us/artist/macklemore/id283347662?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Music117/v4/fc/8a/37/fc8a37af-d549-b6a8-b07b-0befdb0f76f8/source/146x146sr.jpg", "origin": "Seattle, WA", "genre": "Hip-Hop/Rap", "born": "Jun 19, 1983", "latest_release": "GEMINI", "intro": "A grassroots success, Seattle rapper Macklemore not only climbed to number two on the Billboard 200 album charts, but with little mainstream help, his 2012 sophomore release debuted with only Mumford & Sons in his way for the number one spot. Born Ben Haggerty and raised in Seattle, he debuted as Professor Macklemore in 2000 with the Open Your Eyes EP. Five years later his debut album, The Language of My World, earned him a local following, but it was his 2010 team-up with DJ/producer Ryan Lewis for the Vs. Redux EP that yielded the Red Hot Chili Peppers-sampling hit \"Otherside.\" With Macklemore's wit meeting Lewis' inventive production, further hits like \"My Oh My\" and \"Can't Hold Us\" were spread throughout social media and video-sharing sites, setting the stage for a successful sophomore release. That came in 2012 when The Heist dropped as a Macklemore & Ryan Lewis release, debuting at the number two spot on the Billboard 200. Its \"Thrift Shop\" topped the Billboard Hot 100, and the album eventually reached platinum sales status. The duo performed another one of the album's singles, \"Same Love,\" at the 56th Annual Grammy Awards during a marriage ceremony for over 30 couples. That night, the duo took the awards for Best New Artist, Best Rap Album, and Best Rap Performance. In 2015, Macklemore & Lewis returned with \"Downtown,\" the first single from their second collaborative effort, This Unruly Mess I've Made. The 2016 album also featured \"Kevin,\" a song they debuted live at the 2015 American Music Awards with guest star Leon Bridges, along with the elaborate and politically charged second single \"White Privilege II.\" Macklemore followed Mess with a handful of solo singles released in 2016 (\"Drug Dealer\" with Ariana DeBoo and \"Wednesday Morning\") and 2017 (\"Glorious\" with Skylar Grey). The latter track would appear on his official sophomore solo effort, Gemini, which arrived in late 2017. ~ David Jeffries"},
{"artist": "Carly Pearce", "artist_link": "https://itunes.apple.com/us/artist/carly-pearce/id206684981?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Music128/v4/e2/54/be/e254be20-af1e-4e3b-1ded-ccceca5f17c7/source/146x146sr.jpg", "origin": "Taylor Mill, KY", "genre": "Country", "born": "Apr 24, 1990", "latest_release": "Every Little Thing", "intro": "A singer and songwriter with a gift for honest, emotional material, Carly Pearce was already a seasoned veteran when she began to enjoy a commercial breakthrough at the age of 26. Pearce was born in Taylor Mill, Kentucky on April 24, 1990. She showed a precocious talent for music, and was touring as part of a bluegrass band at the age of 11. By the time she was 16, she had quit school and moved to Tennessee, where she became a regular performer at Dolly Parton's country-oriented theme park Dollywood, doing six shows a day, five days a week. Pearce also appeared on a handful of bluegrass collections released by budget labels, including a set of acoustic Christmas numbers. At 19, she was ready to focus on performing her own material, and she relocated to Nashville, where she began earning a reputation as a songwriter. In 2012, Pearce landed artist development and publishing deals with Sony; the company was ultimately unsatisfied with Pearce, and cut her loose from her commitments. But in 2016, Pearce's luck began to turn. She recorded a duet with Josh Abbott, \"Wasn't That Drunk,\" and the independent single became a success, rising to number 36 on the Country Airplay chart. As \"Wasn't That Drunk\" was making an impression at radio, Pearce was introduced to a producer named Busbee, and they began working out material together. One of their tunes, \"Every Little Thing,\" found support at satellite radio in late 2016, and the track clicked with listeners. The powerful Nashville label Big Machine liked \"Every Little Thing,\" and was impressed with Pearce's vocal talents and backlog of songs. Pearce signed a record deal with Big Machine, and reissued \"Every Little Thing\" in early 2017. That October, she released her Busbee-produced debut album, also titled Every Little Thing. ~ Mark Deming"},
{"artist": "Luke Bryan", "artist_link": "https://itunes.apple.com/us/artist/luke-bryan/id20131064?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Features18/v4/28/26/95/28269574-6d85-a2ed-bc71-edd98dda2131/source/735x135sr.jpg", "origin": "Leesburg, GA", "genre": "Country", "born": "Jun 17, 1976", "latest_release": "What Makes You Country", "intro": "Singer and songwriter Luke Bryan comes by his country influences naturally: he grew up in Leesburg, Georgia, a small town 100 miles from the Alabama border where his father grew peanuts and sold fertilizer for a living. Bryan helped his family work the farm when he was young, but in his early teens he developed a passion for country music, picking up his influences from his parents' record collection, listening to the likes of George Strait, Conway Twitty, Ronnie Milsap, Alan Jackson, and Merle Haggard. When he was 14, his folks bought him his first guitar, and a year later his playing and singing were strong enough that he started sitting in with local bands at a club featuring live country music. At 16, Bryan started writing songs with the help of a pair of local tunesmiths who had enjoyed some success in Nashville; he planned to head to Music City to try his luck after graduating from high school until his brother died in an auto accident. Wanting to offer emotional support to his family, Bryan opted to attend Georgia Southern University instead, though he didn't give up music. He continued writing songs, formed a band, and was playing gigs on campus or at nearby watering holes most weekends while pursuing his studies. He recorded a self-released album, which he sold at shows during this period, but was reluctant to take the plunge and devote himself to music full-time until he returned home to work in the family business after receiving his degree. Bryan's dad, confident of his son's talent, made him an offer: he could either move to Nashville or be fired.In the early fall of 2001, Bryan pulled up stakes and relocated to Nashville, where his heartfelt songs of country life earned him a contract with one of the city's many publishing houses. In his free time, Bryan continued to perform at local clubs, and after an A&R man from Capitol Records saw him perform a set of his original material, he was given a record deal. Capitol released Bryan's first widely distributed album, I'll Stay Me, in the summer of 2007, following it with Doin' My Thing in 2009. Doin' My Thing peaked at number two on the country charts -- and at number six on the Top 200 -- and it spawned two number one singles: \"Rain Is a Good Thing\" and \"Someone Else Calling You Baby\" (while \"Do I\" hit number two). Bryan returned with his third album, Tailgates & Tanlines, in the summer of 2011, its release preceded by the single \"Country Girl (Shake It for Me).\" That song was the first of four Top Five country singles pulled from the album: \"I Don't Want This Night to End\" and \"Drunk on You\" both hit number one, while \"Kiss Tomorrow Goodbye\" peaked at number three. This success kept Tailgates & Tanlines in the charts well into 2012, and Bryan supported the record with steady touring. Early in 2013, Bryan compiled his four Spring Break-themed EPs since 2009 as the album Spring Break...Here to Party; it promptly became his first number one album on the pop charts. Bryan solidified his standing in country music by winning ACM's prestigious Entertainer of the Year award in June. That August, he released his fourth studio album, Crash My Party, which hit number one on the country charts and the pop charts. Each of the first four singles from the album -- the title track, \"That's My Kind of Night,\" \"Drink a Beer,\" and \"Play It Again\" -- steadily climbed to number one on the country charts during 2013 and 2014. Bryan chose to close out his series of Spring Break EPs in 2015 with the release of the aptly titled Spring Break...Checkin' Out; the collection went to number one on the Billboard country charts and three on the Billboard 200. Next up was Bryan's fifth full-length album, Kill the Lights, which appeared in 2015 as well. Another number one hit on the Billboard 200, it saw Bryan once again working with producer Jeff Stevens (Jody Stevens was also brought aboard as a co-producer), but unlike Crash My Party, the record saw a heavy dose of originals from Luke: he received writing credits on roughly half of the album's 13 songs. Kill the Lights debuted at number one and was eventually certified platinum, partially on the strength of the hit singles \"Kick the Dust Up,\" \"Strip It Down,\" \"Home Alone,\" \"Huntin', Lovin' and Fishin' Every Day,\" and \"Move.\" In the autumn of 2016, Bryan embarked on his third Farm Tour and released the EP Farm Tour: Here's to the Farmer to commemorate the occasion. The following February, he sang the National Anthem at the Super Bowl. ~ Mark Deming"},
{"artist": "Shawn Mendes", "artist_link": "https://itunes.apple.com/us/artist/shawn-mendes/id890403665?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Features71/v4/aa/01/ef/aa01efad-b4f5-5197-4f70-ec2ade602491/source/735x135sr.jpg", "origin": "Toronto, Ontario, Canada", "genre": "Pop", "born": "Aug 8, 1998", "latest_release": "MTV Unplugged", "intro": "A pop singer/songwriter who broke records with his debut single, Shawn Mendes was born and raised in Toronto, Ontario, Canada. After posting a series of his cover versions to various video-sharing sites, Mendes earned a dedicated following of viewers. His mix of Ed Sheeran and Justin Bieber's styles also appealed to Island Records, who signed Mendes in 2014. That same year they released the then-15-year-old's debut single, \"Life of the Party.\" American radio initially ignored it, but the track entered the Billboard 100 singles chart at number 24, making Mendes the youngest artist to land a debut single in the Top 25. The song was also included on Mendes' four-track Island debut, The Shawn Mendes EP. The EP performed well, reaching number five on the Billboard charts on its way toward sales of over 100,000, setting the stage for his full-length debut, 2015's Handwritten. Preceded by the single \"Something Big,\" Handwritten appeared to strong sales, debuting at number one in both Canada and the U.S. The single \"Stitches,\" which was released that April, became one of Mendes' biggest hits, reaching the Top Ten in the U.S. and Canada and topping the charts in the U.K. and Germany. In addition, his single \"Believe\" landed on the soundtrack for the Disney Channel fantasy musical Descendants. While opening for Taylor Swift on the North American dates of her 1989 World Tour, Mendes and Fifth Harmony's Camila Cabello collaborated on the song \"I Know What You Did Last Summer,\" which appeared on the deluxe version of Handwritten that was released in November 2015; the song reached the Top 20 on the U.S. and Canadian Hot 100 charts. The Top Ten single \"Treat You Better\" preceded Mendes' second album, Illuminate, which was recorded in upstate New York and arrived in September 2016. Illuminate debuted at number one in the U.S. and Canada -- it entered the charts at three in the U.K. -- and it was quickly followed in December by the digital-only Live at Madison Square Garden. Mendes launched a massive world tour in the spring of 2017 and notched another Top Ten single in \"There's Nothing Holdin' Me Back.\" ~ David Jeffries"},
{"artist": "Niall Horan", "artist_link": "https://itunes.apple.com/us/artist/niall-horan/id471260298?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Features118/v4/17/73/30/177330a8-5c65-86d2-560a-167b872a8660/source/735x135sr.jpg", "origin": "Mullingar, Co. Westmeath, Ireland", "genre": "Pop", "born": "Sep 13, 1993", "latest_release": "\n      ", "intro": "Irish singer/songwriter Niall Horan was one-fifth of One Direction, one of the most commercially successful boy bands of all time. As one of the group's more prolific songwriters, he could also play guitar, which helped him kick off a solo career after the group went on hiatus in 2016. Born September 13, 1993 in Mullingar, Co. Westmeath, Ireland, Horan became interested in music at a young age. After his elder brother failed to play the guitar he had received as a Christmas present, Niall picked it up and taught himself to play by watching instructional YouTube videos. Discovering he also had a talent for singing, he began writing songs and performing while still in his early teens, even bagging a support slot with former X Factor contestant Lloyd Daniels at the famous Academy Club in Dublin.At the age of 16, he auditioned for The X Factor, and the rest is history. One Direction, formed on the show in 2010, went on to become one of the most popular groups of the decade, with sales even surpassing the Beatles. Horan was one of the group's principal songwriters and a fan favorite with his baby-faced good looks and sweet tenor. After five albums in five years and the loss of one of their most popular members (Zayn Malik), One Direction took a well-deserved hiatus beginning in January 2016. Later that year, Horan announced he had signed a solo deal with Capitol. His debut solo single, the romantic acoustic ballad \"This Town,\" was released in September, drawing comparisons with Ed Sheeran and reaching number nine on the U.K. singles chart. Two further singles appeared -- \"Slow Hands\" and \"Too Much to Ask\" -- before his debut solo record, Flicker, was released in October 2017. Inspired by the sounds of Fleetwood Mac and the Eagles, the album also featured an appearance by Maren Morris on \"Seeing Blind.\" ~ John D. Buchanan"},
{"artist": "Sam Hunt", "artist_link": "https://itunes.apple.com/us/artist/sam-hunt/id214150835?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Features69/v4/84/b8/ff/84b8ffd4-ea7c-e1de-f5f8-e7524ae2ac61/source/735x135sr.jpg", "origin": "Cedartown, GA", "genre": "Country", "born": "Dec 8, 1984", "latest_release": "Ex to See (15 in a 30 Tour Live) - Single", "intro": "Country singer/songwriter, guitarist, and pianist Sam Hunt was born and raised in rural Cedartown, Georgia, where he was a gifted athlete and had a fine career as a college quarterback at both Middle Tennessee State University and the University of Alabama at Birmingham. Although he was good enough to be signed as a free agent for a time with the Kansas City Chiefs, Hunt was drawn increasingly to music. He had grown up on, and loved, 1990s country, and after hearing all manner of rap, R&B, and other urban pop styles in college locker rooms, he developed a singing and songwriting style that gently blended all of this, and he headed off to Nashville, ground zero for hopeful country songwriters, to begin his career.Quickly signed to a publishing deal, he applied the self-discipline he learned as an athlete, and began writing better and better songs, finally breaking through when songs he wrote or co-wrote were recorded by country stars Kenny Chesney (\"Come Over,\" which went on to become a number one single), Keith Urban (\"Cop Car\"), Billy Currington (\"We Are Tonight\"), and others. Hunt made his commercial recording debut when he independently released a single, \"Raised on It,\" in 2013, followed by a 15-song demo mixtape called Between the Pines that same year, also independently released. Hunt signed a recording deal with MCA Nashville early in 2014, and the label released a single, \"Leave the Night On,\" that same year in advance of an album. \"Leave the Light On\" became a number one country hit later that year, setting the stage for the October release of Hunt's debut, Montevallo. It debuted at number one on the country chart and number three on the pop chart and generated three additional hits: \"Take Your Time\" and \"House Party,\" which both reached number one, and \"Break Up in a Small Town.\" As the latter rode the charts, his 2013 \"acoustic mixtape\" Between the Pines was re-released in October 2015. Montevallo generated one further single -- \"Make You Miss Me\" -- in 2016, but Hunt spent the majority of that year working on his second album. \"Body Like a Back Road,\" the first taste of his sophomore set, appeared in February 2017. ~ Steve Leggett"},
{"artist": "Walker Hayes", "artist_link": "https://itunes.apple.com/us/artist/walker-hayes/id382876655?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is3-ssl.mzstatic.com/image/thumb/Music111/v4/9e/54/f8/9e54f8e3-e0ac-ea56-7bd8-58610c13e100/source/146x146sr.jpg", "origin": "Mobile, AL", "genre": "Country", "born": "", "latest_release": "boom.", "intro": "With a honey-smooth voice and a gently edgy songwriting approach, country singer Walker Hayes works to the Keith Urban side of things, where pop and country merge with a dose of rock attitude, reflecting the 21st century version of commercial country. Born in Mobile, Alabama, Hayes grew up in a large blended family and learned to play piano early. While he was a regular participant in choirs, choral groups, and musical theater, most of his attention went to sports, primarily basketball and track. Eventually music went from being Hayes' fallback plan to his main interest, and he earned a music degree with an emphasis on piano at Alabama's Birmingham-Southern College before moving on to attend the University of North Carolina at Chapel Hill. Hayes moved with his wife to Nashville in 2004, and even though he'd only written a couple of songs, he began to study the craft, and within a year he had a publishing deal.When a demo intended for Keith Urban that featured Hayes' assured vocals crossed the desks at Capitol Records Nashville, the label staff was much impressed, and Hayes was signed almost immediately. Paired with producer Marshall Altman, Hayes began recording a debut album, and his first single, \"Pants,\" was released in 2010. The single fared reasonably well, edging into the country singles charts, but the album, Reason to Rhyme, didn't appear until 2013. Hayes was at odds with the label, and Capitol released him from his contract. After signing a new publishing deal, Hayes set up a small songwriting studio he called \"the shack,\" and began experimenting with songs that incorporated elements of hip-hop, pop, and R&B. One of Hayes' efforts, \"Pimpin' Joy,\" was released as a digital single and became a viral success. In early 2016, Hayes put together eight of his demos from the shack, and released them as a free digital EP he titled 8Tracks, Vol. One: Good Shit. Posted to music streaming services, the simplicity and easygoing attitude of the music won Hayes a new following, and he made plans to release a second 8Tracks volume. The following year he returned with his sophomore album, boom., featuring the single \"You Broke Up with Me.\" ~ Steve Leggett"},
{"artist": "LANCO", "artist_link": "https://itunes.apple.com/us/artist/lanco/id1023958275?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music122/v4/66/be/72/66be7261-83b9-2cec-b82c-e158dbe26aeb/source/146x146sr.jpg", "origin": "Nashville, TN", "genre": "Country", "born": "2013", "latest_release": "LANCO - EP", "intro": "Country-rock band LANCO -- which stands for Lancaster & Company -- were formed in 2013 by namesake and frontman Brandon Lancaster. Hailing from Georgia, Tennessee, and Kentucky, the quintet was rounded out by drummer Tripp Howell, guitarist Eric Steedly, keyboardist Jared Hampton, and bassist Chandler Baldwin. Crafting feel-good country anthems tinged with classic rock and blues edges, LANCO got their start after a chance meeting between Lancaster and producer Jay Joyce (Eric Church, Little Big Town) at a Keith Urban concert. Joyce signed LANCO to his publishing company and produced their eponymous debut EP. The band signed with Sony Music Nashville imprint Arista Nashville in late 2015. Their second EP, Extended Play, was released in early 2016. It contained three of the same songs as their debut, exchanging \"High\" for newer track and lead single \"Long Live Tonight,\" a pop-fused country song with a Kings of Leon undercurrent. Their song \"American Love Story\" was also featured as the theme for the Netflix series The Ranch. ~ Neil Z. Yeung"},
{"artist": "J Balvin & Willy William", "artist_link": "https://itunes.apple.com/us/artist/j-balvin/id444520760?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Features111/v4/c6/bf/e7/c6bfe733-95c4-2a63-9ccd-e65a17cbeddd/source/735x135sr.jpg", "origin": "Medellin, Colombia", "genre": "Urbano latino", "born": "May 7, 1985", "latest_release": "Sensualidad (feat. Mambo Kingz & DJ Luian) - Single", "intro": "J Balvin is the stage name of José Álvaro Osorio Balvin from Medellín, Colombia. Balvin is a reggaeton singer whose polished urban singles and best-selling albums have made him a top-tier Latin pop artist. He became interested in music at a young age while listening to rap, champeta, bachata, and reggae on the radio. He was also a big fan of music videos; it was from these that he began to develop his dance moves and cultivate his own style. He signed to EMI Colombia in 2009 and released his first single, \"Ella Me Cautivó,\" which charted at 35 on the U.S. tropical chart. This was followed by the release of the full-length Real in 2010. Balvin contributed four tunes to the soundtrack of the Tim Bulot film El Negocio. All of them charted, including \"En Lo Oscuro,\" which hit the top spot in his native country. Balvin was a featured vocalist on the Colombian version of Robin Thicke's smash single \"Blurred Lines,\" which was issued in October of 2013, just prior to his own second album, La Familia. All four singles from the album charted in Colombia's Top Ten, and \"Yo Te Lo Dije\" hit number two on the rhythm chart and number nine on the Latin pop chart in the U.S. The B Sides collection appeared in September of 2014, featuring two more radio chart-topping singles in \"6 AM\" and \"Ay Vamos.\" The latter won a Latin Grammy for Best Urban Song. His 2015 single \"Ginza,\" the official pre-release for his next album, entered the Hot Latin Songs chart at number one, topped several others, and was certified platinum. Balvin's collaborations were as notable as his own work that year. He and Julión Álvarez were featured on Juan Gabriel's single \"La Frontera.\" His \"Latino Remix\" of Justin Bieber's smash \"Sorry\" scored big for both artists at Latin pop radio and in digital streaming and downloads. In 2016, Balvin won the Premios Lo Nuestro Artist of the Year Award and was a featured guest on both Sofia Carson's charting debut single, \"Love Is the Name,\" and on Alejandro Sanz's \"Cuando Seas Grande\" -- from a performance at La Voz -- along with Gloria Trevi and Los Tigres del Norte. In May he released the single \"Bobo\"; it topped the Latin songs chart. \"Safari,\" featuring Pharrell Williams, BIA, and Sky, was released in June, followed by the full-length Energia. The album, produced by Sky and featuring contributions from Bull Nene, Daddy Yankee, Fuego, Yandel, and Juanes, hit the top spot on several Latin album charts. The following year, he guested on Wale's \"Colombia Heights\" single. ~ Thom Jurek"},
{"artist": "Blake Shelton", "artist_link": "https://itunes.apple.com/us/artist/blake-shelton/id189204?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is4-ssl.mzstatic.com/image/thumb/Features20/v4/7f/6c/66/7f6c6684-e143-3346-7945-84aa84cd10a5/source/735x135sr.jpg", "origin": "Ada, OK", "genre": "Country", "born": "Jun 18, 1976", "latest_release": "Texoma Shore", "intro": "Blake Shelton may have been an unlikely candidate for superstardom but that's hardly due to a lack of charisma. Shelton possessed a warm, masculine ease that lent his rowdier numbers a sense of sly humor but this relaxed touch also made him an effective crooner of ballads, the ace in the hole that helped him cross over from country to the mainstream in the 2010s. His transition to being a household name certainly was assisted by his starring role as a judge on NBC's hit musical competition The Voice, but by that point Shelton had racked up plenty of number one country hits, beginning with his 2001 debut \"Austin\" and running through \"Some Beach,\" \"Home,\" \"Doin' What She Likes,\" \"She Wouldn't Be Gone,\" \"Hillbilly Bone,\" \"All About Tonight,\" and \"Honey Bee,\" the 2011 single that went triple platinum around the time The Voice hit the airwaves. Over the next few years, Shelton was at the apex of his stardom, appearing regularly on The Voice, earning headlines through his marriage to fellow country singer Miranda Lambert, and staying in the Top Ten with the singles \"Sure Be Cool If You Did,\" \"Boys Round Here,\" and \"Neon Light,\" hits that proved he was one of the biggest country stars of the 21st century.A native of Ada, Oklahoma, Blake Shelton picked up the guitar in his early adolescence and started writing songs not long afterward. Bitten by the musical bug, he started working the local bar circuit, earning a large enough following to win the Denbo Diamond Award, a prize given to young Oklahoma entertainers. He left his home state for Nashville just two weeks after his high-school graduation in 1994, peddling his songs to Music City publishing houses, including Warner/Chappell Music, Jerry Crutchfield Music, and Naomi Martin Music. Bobby Braddock, the legendary songwriter behind George Jones' \"He Stopped Loving Her Today,\" discovered Shelton in the late '90s and brought the singer to the attention of Giant Records in 2001. Braddock wrote \"I Want to Talk About Me\" with the intention of making the rap-influenced number Shelton's first single but Giant rejected the notion (it was recorded instead by Toby Keith, who turned it into a country number one). What came instead was \"Austin,\" a single that outlasted its record company. Giant shuttered not long after the release of \"Austin\" and Warner took over Shelton's contract, keeping the single in print and helping it reach number one on the country charts. Spending five weeks at the top of the charts, the single -- along with its follow-ups \"All Over Me\" and \"Ol' Red,\" which reached 18 and 14, respectively -- helped his eponymous 2001 full-length debut reach three on the Billboard country charts; it would also earn a platinum certification. The Dreamer, his sophomore set, appeared in February 2003 and although its lead single \"The Baby\" was a hit, spending three weeks at the top of the Billboard country charts, the album was something of a commercial underperformer, with neither \"Heavy Liftin'\" nor \"Playboys of the Southwestern World\" cracking the Top 20. \"When Somebody Knows You That Well,\" the first single from 2004's Blake Shelton's Barn & Grill, didn't reverse this downward trajectory as it reached a peak position of 37, but the next single, \"Some Beach,\" was his biggest since \"Austin,\" spending four weeks at number one and becoming a 21st century standard. Blake Shelton's Barn & Grill spawned two other Top Ten hits -- \"Goodbye Time\" and \"Nobody But Me,\" which made it to four -- and he kept the momentum going on 2007's Pure BS, which featured \"Don't Make Me,\" \"The More I Drink,\" and the number one single \"Home.\" Pure BS also featured a cameo from Miranda Lambert, a runner-up on Nashville Star who had started dating Shelton. Over the next few years, their relationship strengthened -- they appeared on each other's records and married in 2011 -- and this romance helped elevate the profile of both singers. Shelton's 2008 Startin' Fires boasted two big hits -- the number one \"She Wouldn't Be Gone\" and Top Ten \"I\"ll Just Hold On\" -- but the album was his first record not to be certified gold. This proved to be a minor bump in the road for Shelton. In 2010, he released a pair of successful EPs (Hillbilly Bone, All About Tonight) along with the hits collection Loaded: The Best of Blake Shelton (which contained the title tracks from the two EPs), and then in 2011 his breakthrough into the mainstream arrived via the NBC televised singing competition The Voice. As one of four celebrity coaches -- he was paired with Adam Levine of Maroon 5, Christina Aguilera, and Cee Lo Green, each representing a different style of music -- Shelton became a household name and he soon had record sales to match. Red River Blue, his summer 2011 album, was his first to reach number one on the Top 200 (it also topped the country charts) and that was on the strength of four hit singles: \"Honey Bee\" and \"God Gave Me You,\" both certified triple platinum; and \"Drink on It\" and \"Over,\" which topped out at platinum. After a pit stop for a holiday album in 2012 (Cheers, It's Christmas, which featured appearances by Lambert, her band Pistol Annies, Kelly Clarkson, Reba McEntire, and Michael Bublé), Shelton's streak intensified in 2013 with Based on a True Story..., his biggest-selling album to date. Anchored by the hits \"Sure Be Cool If You Did,\" \"Boys Round Here,\" \"Mine Would Be You,\" \"Doin' What She Likes,\" and \"My Eyes,\" Based on a True Story sold over 1.4 million copies and generated hits into 2014, which is when he delivered Bringing Back the Sunshine. Another hit right out of the box -- debuting at number one on Billboard's Top 200 -- it had the hit singles \"Neon Light,\" the Ashley Monroe duet \"Lonely Tonight,\" and \"Sangria.\" As his career rolled on, Shelton experienced personal loss when he and Lambert announced their divorce in the summer of 2015. Shelton released a second hits collection named Reloaded: 20 #1 Hits in October of 2015; it was accompanied by a new single called \"Gonna.\" \"Came Here to Forget,\" the first single from Shelton's tenth studio album, appeared in March 2016, followed quickly by \"Savior's Shadow\" in April. The full-length album If I'm Honest appeared that May. A year later, in September 2017, Shelton returned with the single \"I'll Name the Dogs,\" which was the first single from his November album Texoma Shore. ~ Stephen Thomas Erlewine"},
{"artist": "Kelly Clarkson", "artist_link": "https://itunes.apple.com/us/artist/kelly-clarkson/id316265?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is5-ssl.mzstatic.com/image/thumb/Music118/v4/4d/74/75/4d74756b-7793-8a71-d67e-33f36c295149/source/146x146sr.jpg", "origin": "Fort Worth, TX", "genre": "Pop", "born": "Apr 24, 1982", "latest_release": "Love So Soft (Collipark Remix) - Single", "intro": "The winner of Fox TV's first American Idol competition during the summer of 2002, Kelly Clarkson went from an anonymous talent to a nationally known singer in a matter of months, performing for an audience of millions. One of the show's most naturally gifted singers, the affable Texan then went on to enjoy a successful pop career, with only Carrie Underwood rivaling her as American Idol's most commercial export.Clarkson was born in Fort Worth and raised in Burleson, Texas, and her vocal talents were discovered in seventh grade, when a music teacher heard her voice and urged Clarkson to join the school choir. After high school, she opted to skip college and went to Hollywood to make her name; she appeared as an extra on an episode of Sabrina, the Teenage Witch, but no other opportunities materialized. Upon returning to Burleson, Clarkson worked at a movie theater, promoted Red Bull energy drinks, and ultimately worked as a cocktail waitress at a comedy club before entering the American Idol contest. One of 10,000 aspiring singers, Clarkson distinguished herself not only with her big, surprisingly mature voice, but also with her down-to-earth charm and sense of humor; at one of her auditions, she switched places with judge Randy Jackson, who did an impromptu version of R. Kelly's \"I Believe I Can Fly.\" Over the course of the 13-week show, her consistently strong performances of songs like \"Respect,\" \"Natural Woman,\" \"Stuff Like That There,\" and \"Without You\" earned Clarkson enough audience votes to claim one of the contest's two finalist positions. After singing \"A Moment Like This\" and \"Before Your Love,\" both of which were written for the show, Clarkson won the American Idol contest with 58 percent of the audience's votes. In addition to the show's prize of one million dollars and a recording contract with RCA, Clarkson secured a deal with Creative Artists Agency and several bookings, including the national American Idol tour and a performance of the national anthem at the September 11 commemoration at Washington, D.C.'s Lincoln Memorial. Despite her newfound fame, Clarkson opted to remain in Texas rather than move to New York or Los Angeles. Her first single, \"A Moment Like This,\" was released just two weeks after she won the contest and quickly earned platinum sales. Clarkson's debut full-length, Thankful, was released in spring of 2003, just in time to coincide with the second season of American Idol (and right before the American Idol movie, From Justin to Kelly). Breakaway followed in late 2004 and was a huge success, selling over five million copies (making it the third best-selling album of 2005) and spawning the hit singles \"Because of You,\" \"Behind These Hazel Eyes,\" and the enormously popular \"Since U Been Gone.\" That song and Breakaway earned Grammys for Best Female Pop Vocal Performance and Best Pop Vocal Album, respectively, at the 48th Annual Grammy Awards in early 2006. Clarkson continued her busy touring schedule into the summer and announced plans for her third album.Clarkson released My December, the studio follow-up to Breakaway, in 2007. Notable as Clarkson's first foray into songwriting, My December featured a darker, more rock-oriented edge than its predecessor and even featured a guest appearance by punk icon and bassist Mike Watt. However, label exec Clive Davis openly disapproved of the album's direction, claiming that it lacked the commercial appeal of Breakaway. A public feud ensued, and Clarkson was dealt another blow when poor ticket sales resulted in the cancellation of her upcoming tour. The leadoff single \"Never Again\" nevertheless became a Top Ten pop hit, and My December climbed its way to platinum status by the year's end. Clarkson returned to the top of the charts in early 2009, when the sugary single \"My Life Would Suck Without You\" set a record for the largest leap to number one. Composed by songwriting vets Max Martin, Lukasz Gottwald, and Claude Kelly, the song also set the stage for her fourth album, All I Ever Wanted, whose pop-minded material was mostly produced by OneRepublic's Ryan Tedder. While touring in support of All I Ever Wanted, Clarkson announced that she had begun work on material for her follow-up. Eventually, she collaborated with a handful of writers and producers, including Claude Kelly and Howard Benson, as well as Jason Halbert, Rodney Jerkins, and others. In 2011, Clarkson released the resulting album, Stronger. Her fifth studio effort, the album featured the single \"Mr. Know It All.\" A Greatest Hits package followed in 2012, and Clarkson's first holiday album, Wrapped in Red, was released in October of 2013. As well as the usual selection of festive favorites, it included a number of newly written songs, including several co-penned by Clarkson herself.Clarkson spent much of 2014 recording her next LP with producer Greg Kurstin. The first single, \"Heartbeat Song,\" appeared in January 2015 and, a few months later, Piece by Piece debuted atop the Billboard 200. This marked her third number one album and first since 2009. It included songs penned by Sia Furler and Kara DioGuardi, as well as a feature for John Legend on \"Run Run Run.\" Nearly a year later, after a heartfelt performance during the final season of American Idol, title track \"Piece by Piece\" shot into the Billboard Top Ten and went on to garner a Grammy nomination for Best Pop Solo Performance. Following the unexpected success of the single, Clarkson joined Missy Elliot, Janelle Monáe, Kelly Rowland, Lea Michele, and Zendaya on the song \"This Is for My Girls,\" which was part of First Lady Michelle Obama's third-world education campaign called \"Let Girls Learn.\" Months later, Clarkson announced that she had signed with Atlantic. In June 2016, she also unveiled kellyclarksonlive.com, which distributed live recordings of fan-requested cover songs performed during her Piece by Piece tour, including Radiohead's \"Creep\" and Coldplay's \"Fix You.\" By the year's end, she'd contributed to the Hamilton Mixtape (\"It's Quiet Uptown\") and the soundtrack to The Shack, the latter of which, a duet with Aloe Blacc called \"Love Goes On,\" was released as a single in February 2017. In September of that year, Clarkson released \"Love So Soft,\" the lead single from her forthcoming eighth studio album, Meaning of Life, which was expected in October. ~ Heather Phares"},
{"artist": "Bebe Rexha", "artist_link": "https://itunes.apple.com/us/artist/bebe-rexha/id466059563?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music118/v4/74/36/56/743656d3-432b-1475-9575-580addbdc6cc/source/146x146sr.jpg", "origin": "New York, NY [Brooklyn]", "genre": "Pop", "born": "Aug 30, 1989", "latest_release": "\n      ", "intro": "Renowned for her songwriting prowess on hits by Eminem and Selena Gomez, Brooklyn-born singer/songwriter Bebe Rexha started her musical journey at a young age. Performing in musicals from the age of four, she started to hone her music skills in her early teens and was named Best Teen Songwriter at the National Academy of Recording Arts and Sciences' annual Grammy Day event; she met a whole host of famous producers. In 2010, she was approached by Fall Out Boy's Pete Wentz to form the project Black Cards, intended to reflect Wentz's more experimental and electronic side. Rexha provided vocals to several EPs before she left the band in 2012 to embark on a solo career. She began uploading demos and acoustic covers to YouTube before signing with Warner Bros. in 2013. Rexha penned several hits for the likes of Gomez (\"Like a Champion\") and Nikki Williams (\"Glowing\"), but it was \"The Monster\" -- her composition for Eminem and Rihanna -- that really caught the attention of the industry. The track reached number one on the Billboard Hot 100 and allowed Rexha to prepare for life as a solo artist. Following this success, she released her first EP, I Don't Wanna Grow Up in May 2015, featuring the singles \"I'm Gonna Show You Crazy\" and \"I Can't Stop Drinking Without You.\" As she continued to write for her full-length debut, Rexha scored a hit on a collaboration with rapper G-Eazy on \"Me, Myself & I,\" which reached the Top Ten on the pop chart in 2016. She was also featured on the Martin Garrix hit \"In the Name of Love,\" which climbed into the Top 30 by the end of the year.The first taster for her solo debut was the Captain Cuts-produced \"I Got You,\" which appeared in late 2016 and reached the pop chart early the following year. Rexha's first album actually became a set of two EPs, beginning with All Your Fault, Pt. 1 in early 2017. A six-song set, it included guests Ty Dolla $ign on the Stargate-produced \"Bad Bitch,\" and G-Eazy returning a favor on \"F.F.F.\" All Your Fault, Pt. 2 followed in August, another six-track set including \"The Way I Are (Dance with Somebody)\" with Lil Wayne, and other features for 2 Chainz, Gucci Mane, Cashmere Cat, and country hitmakers Florida Georgia Line. ~ Aneet Nijjar"},
{"artist": "Ed Sheeran", "artist_link": "https://itunes.apple.com/us/artist/ed-sheeran/id183313439?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Features122/v4/6f/96/92/6f96928f-532e-f486-39e9-ac1f020a25aa/source/735x135sr.jpg", "origin": "Halifax, West Yorkshire, England", "genre": "Singer/Songwriter", "born": "Feb 17, 1991", "latest_release": "Shape of You (NOTD Remix) - Single", "intro": "Flame-haired singer/songwriter, beatboxer, and guitarist Ed Sheeran's eclectic blend of acoustic pop, folk, and hip-hop has been championed by everyone from the underground grime scene to American Oscar winners. Born in Halifax, West Yorkshire, England in 1991, Sheeran released his first EP, The Orange Room, while still at school, and his first two albums -- his self-titled debut and Want Some -- by the age of 16. After moving to London to gain more live experience, his performance of the self-penned \"You Need Me, I Don't Need You\" on YouTube channel SB.tv gained half-a-million viewers and attracted the attention of actor/R&B star Jamie Foxx, who invited him to appear on his Los Angeles Sirius radio show.Securing a deal with Elton John's management company, he supported Example on his U.K. tour and, after signing with Atlantic, became just the third artist to score a Top 75 album purely on download sales, when his No. 5 Collaborations project, a star-studded seven-track EP featuring Wiley, JME, and Devlin, charted at number 47 in 2011. That same year he released the Loose Change EP (which featured the smash hit single \"The A Team\") and his major-label debut studio album + (\"Plus\"). + was a massive hit, selling over a million copies in the U.K. alone in just six months, and charting high in many other countries, including the U.S., where it peaked at number five. Sheeran then went about boosting his profile, co-writing songs for One Direction and Taylor Swift. He toured the U.S. with Swift on her massive 2013 arena tour, and saw his song, \"I See Fire,\" featured in the closing credits of the hit movie The Hobbit: The Desolation of Smaug.By the end of 2013, Sheeran had shifted his focus from performing to recording his sophomore album, with Rick Rubin and Pharrell producing. In keeping with the mathematical theme, the album was titled X (\"Multiply\"). Appearing in June 2014, X encompassed his acoustic/hip-hop hybrid sound, but it also had an R&B feel in places, along with straight-ahead pop. The record debuted at number one on both the U.K. and U.S. charts, reached gold or platinum status in 15 countries, and the singles for \"Sing\" and \"Thinking Out Loud\" both topped the British charts. The following year, X won British Album of the Year at the 2015 Brit Awards, with Sheeran winning British Male Solo Artist. The year was a huge success for his live performances, too: he landed an opening slot for the Rolling Stones at one of their U.S. arena concerts, and went on to completely sell-out three dates at London's Wembley Stadium, which was documented for an exclusive NBC special. He continued to win awards while promoting X, most notably at the 2015 MTV Europe Music Awards, where he was awarded Best Live Act, and the 2016 Grammy Awards Ceremony, where he won Song of the Year and Best Solo Pop Performance. Later that year, X was declared the second internationally best-selling album of 2015. After a year-long hiatus, Sheeran posted a cryptic tweet in December of 2016, hinting that new music was around the corner. Early in 2017, he released two singles, \"Castle on the Hill\" and \"Shape of You,\" and their parent album ÷ (\"Divide\") appeared that March. It topped the pop charts in over 20 territories, including the U.K. and U.S. ~ Jon O'Brien"},
{"artist": "Sam Smith", "artist_link": "https://itunes.apple.com/us/artist/sam-smith/id156488786?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is3-ssl.mzstatic.com/image/thumb/Features128/v4/70/85/68/708568be-cd16-218c-15bc-514f5efd4f9a/source/735x135sr.jpg", "origin": "London, England", "genre": "Pop", "born": "May 19, 1992", "latest_release": "The Thrill of It All", "intro": "Distinctively emotive, soul-inspired vocalist Sam Smith was among the most commercially successful artists to arrive during the early 2010s. Prior to his breakthrough at the age of 21, the London, England-born singer and songwriter balanced study with music, sang in choirs and in bands, and performed in musical theater productions. He developed a passionate approach to singing exemplified by his favorite artists at that time: Aretha Franklin, Stevie Wonder, and Chaka Khan. He was barely out of his teens when, in late 2012, he appeared as the featured vocalist on \"Latch,\" the fourth single by production duo Disclosure. A loping mixture of U.K. garage and contemporary dance-pop, the song went to number 11 in the U.K. Over in the U.S., it took significantly longer to take hold but eventually hit number seven there and was certified platinum four times over.The singer's debut solo single, released in February 2013, took a more tempered path. Produced by the favor-returning Disclosure, \"Lay Me Down\" recalled the stripped-back material that had proved successful for Adele. Only three months later, producer/songwriter Shahid \"Naughty Boy\" Khan followed his Emeli Sandé-fronted U.K. Top Ten hit \"Wonder\" with \"La La La,\" featuring a powerful lead vocal from Smith (who had just finished a series of dates in support of Sandé). It was an instant number one U.K. hit. In October 2013, Smith issued the Nirvana EP, which included an acoustic reading of \"Latch,\" and by the end of February 2014 he was back at the top of the U.K. chart with \"Money on My Mind,\" which inventively married his relaxed vocal with a frenetic beat. Smith's debut full-length, In the Lonely Hour, was released that May in the U.K., and topped the album chart. It arrived in the U.S. the following month and peaked at number two there. The singles \"Stay with Me,\" \"I'm Not the Only One,\" and \"Lay Me Down\" hit the Top Ten in both the U.K. and U.S. In the Lonely Hour led to awards from organizations as varied as the BRITs, the Grammys, Billboard, and BET. The album was the second best-selling album of 2014 in the U.K. and U.S., behind only titles by Ed Sheeran and Taylor Swift, respectively. In 2015, Smith recorded another Disclosure collaboration, \"Omen,\" eventually placed on the duo's Caracal. Smith also earned the high honor of being chosen to record the theme for a James Bond film. \"Writing's on the Wall,\" recorded for the Spectre soundtrack, was the first Bond theme to go to number one in the U.K. An expanded version of In the Lonely Hour, the \"Drowning Shadows Edition,\" was released that November with new material and previously released stray tracks added to the original album content. Following a Golden Globe win for \"Writing's on the Wall,\" Smith spent most of 2016 and early 2017 in the studio recording his follow-up album. \"Too Good at Goodbyes,\" the lead single from his second album, was released in early September 2017. ~ James Wilkinson & Andy Kellman"},
{"artist": "Halsey", "artist_link": "https://itunes.apple.com/us/artist/halsey/id324916925?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is3-ssl.mzstatic.com/image/thumb/Features111/v4/01/59/90/015990c5-744c-f8f2-c2aa-2e79b7488a4c/source/735x135sr.jpg", "origin": "Washington, NJ", "genre": "Alternative", "born": "Sep 29, 1994", "latest_release": "Bad at Love (Remixes) - EP", "intro": "Halsey is the alias of New York-based pop artist Ashley Frangipane. The New Jersey native took her moniker from a New York L train subway stop, and her adopted city plays a large role in both the sound and lyrics of her dark, gritty electro-pop, which has been compared to acts like Chvrches and Lorde. Based on the strength of her first single \"Ghost,\" she signed a deal with Capitol-owned electronic/dance label Astralwerks in early 2014. Her debut EP, Room 93, arrived in October of that same year. In 2015, Halsey released her debut full-length album, Badlands, which featured production from Lido, the Futuristics, Son Lux, and others. Included on the album were the singles \"Ghost,\" \"New Americana,\" \"Colors,\" and \"Castle,\" a version of which also appeared on the soundtrack to The Huntsman: Winter's War. Badlands debuted at number two on the Billboard 200 chart and sold well, ultimately achieving gold certification status. In January 2017, Halsey returned with the single \"Not Afraid Anymore,\" which was featured on the Fifty Shades Darker soundtrack. Three months later, she released \"Now or Never,\" the first single from her sophomore album, Hopeless Fountain Kingdom. Containing collaborations with Sia, Greg Kurstin, and Benny Blanco, the LP appeared in June 2017 and topped the Billboard 200. ~ Timothy Monger"},
{"artist": "Portugal. The Man", "artist_link": "https://itunes.apple.com/us/artist/portugal-the-man/id167649475?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is3-ssl.mzstatic.com/image/thumb/Music2/v4/40/b8/3a/40b83a7c-430b-179f-aeb8-89003f51c893/source/146x146sr.jpg", "origin": "Wasilla, AK", "genre": "Alternative", "born": "2003", "latest_release": "Feel It Still (The Remixes)", "intro": "There has to be some credit given for this band's name alone -- co-founder John Gourley once explained it as an attempt to create a demi-mythic entity bigger than the individual members. Formed in Wasilla, Alaska, experimental indie pop group Portugal. The Man grew out of the ashes of Anatomy of a Ghost, a post-hardcore band whose vocalist and guitarist -- Gourley and Zach Carothers, respectively -- opted to continue working together. Rounding out the new band's lineup was keyboardist/singer Wes Hubbard, himself a veteran of other Alaskan groups, and the trio eventually relocated from Alaska to Portland, Oregon. Their initial existence in the Pacific Northwest was the typical hardscrabble life of a band with few resources, but drummer Jason Sechrist (formerly of Konmai Defense System) joined to form a more stable lineup. The band's profile received a boost from the Internet (the musicians made heavy use of MySpace and PureVolume for promotional purposes), and Portugal. The Man released an EP in 2005 before issuing their debut album, Waiter: You Vultures!, in early 2006. In 2007, the group (whose lineup had once again reverted to three members, as Hubbard had left and was replaced by touring keyboardist Ryan Neighbors) issued Church Mouth, whose aggressive sound bore traces of Led Zeppelin and Jane's Addiction. The bandmates then opted to finance their third record themselves, drawing upon a wealth of guest musicians -- including trombonists, trumpeters, and violinists -- to create the eclectic Censored Colors. In 2009 the group released The Satanic Satanist, which became their first record to chart on the Billboard 200. They quickly followed it with the mellower and more electronic American Ghetto, and the band signed with Atlantic Records later in 2010.Guitarist Noah Gersh joined the lineup for Portugal. The Man's 2011 summer tour, and the group recorded its major-label debut album, In the Mountain in the Cloud, in late 2011. Produced by John Hill and mixed by Andy Wallace, it was released in July of 2012. Around that time, Sleep Forever, a 13-minute short directed by Michael Ragen and shot entirely in Gourley's hometown, premiered on the Independent Film Channel. It would be the last recording for members Sechrist and Neighbors, who were replaced by drummer Kane Ritchotte and keyboardist Kyle O'Quin. Portugal. The Man enlisted Danger Mouse (Brian Burton) as producer for 2013's Evil Friends, which was released in June of 2013. They returned to the studio in 2014 with the Beastie Boys' Mike D for their eighth studio album. The recordings were eventually scrapped, however, and the band emerged in 2017 with fresh material via the self-produced Woodstock. Led by the single \"Feel It Still,\" it was named in honor of the 1969 festival and their attempt to \"say something that mattered\" in a context of sociopolitical unrest. ~ Ned Raggett"},
{"artist": "Maroon 5", "artist_link": "https://itunes.apple.com/us/artist/maroon-5/id1798556?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Features1/v4/2f/fa/49/2ffa49e9-3519-2533-7c8a-35c29436f0f5/source/735x135sr.jpg", "origin": "Los Angeles, CA", "genre": "Pop", "born": "1999", "latest_release": "Red Pill Blues", "intro": "A mix of polished pop/rock and neo-soul made Maroon 5 one of the most popular bands of the new millennium, with songs like \"This Love,\" \"She Will Be Loved,\" and \"Makes Me Wonder\" all topping the charts worldwide. Previously, bandmates Adam Levine (vocals/guitar), Jesse Carmichael (keyboards), Mickey Madden (bass), and Ryan Dusick (drums) had spent the latter half of the '90s playing in Kara's Flowers, even releasing a debut album for Reprise Records while still attending high school. The record tanked, however, and Kara's Flowers found themselves dropped from Reprise's roster. After briefly attending college, the bandmates regrouped as Maroon 5, adding former Square guitarist James Valentine to the lineup and embracing a more R&B-influenced sound. Several years later, the quintet had officially risen to the forefront of pop music with Songs About Jane and It Won't Be Soon Before Long, both of which went multi-platinum. Songs About Jane propelled the band into the mainstream, but the album was not an immediate hit. Octone Records had signed the newly christened Maroon 5 in 2001, and the debut album Jane received a lukewarm response upon its release in June 2002. \"Harder to Breathe\" became a radio staple 17 months later and was soon followed by the omnipresent \"This Love,\" whose steamy video (featuring frontman Levine and a barely clothed girlfriend) wooed the TV-watching crowds at MTV. Songs About Jane finally entered the Billboard Top Ten in August 2004, more than two years after the album's release, and follow-up singles like \"She Will Be Loved\" and \"Sunday Morning\" helped the album move over 2.7 million copies by year's end. Maroon 5 toured exhaustively in support of Jane's slow-burning success, issuing two stopgap recordings -- 2004's 1.22.03.Acoustic and 2005's Live Friday the 13th -- while traveling the world alongside the likes of the Rolling Stones and John Mayer. Their schedule was especially trying on percussionist Dusick, who sustained wrist and shoulder injuries and was often unable to play. By fall 2006, Dusick had been officially replaced by Matt Flynn (the former drummer for Gavin DeGraw), and the revised band released its sophomore effort in May 2007. It Won't Be Soon Before Long proved to be less popular than its predecessor (which had sold more than four million copies in the U.S. alone), but it still enjoyed double-platinum certification while spinning off the chart-topping single \"Makes Me Wonder.\" Maroon 5 had cemented their status as pop/rock heavyweights, and they now had the connections to prove it. Released in late 2008, Call and Response: The Remix Album reinterpreted the band's catalog with remixes by influential producers like Mary J. Blige, Mark Ronson, and Pharrell Williams.Between 2008 and 2010, the band worked with a different producer -- veteran rock/country architect Robert John \"Mutt\" Lange -- on a third studio album, Hands All Over, which was released in September 2010. Although it was kept from the top of the album charts, it went platinum. Also, the following year, it received a big boost when Levine began appearing as a judge on the NBC reality television talent competition The Voice. That same year, Hands All Over was re-released with the single \"Moves Like Jagger,\" featuring Levine's The Voice co-judge Christina Aguilera; the single promptly hit the top of the charts. In 2012, Carmichael revealed that he was taking time off from performing with Maroon 5 and would be replaced by touring keyboardist PJ Morton.In April of 2012, the band teased the release of its fourth studio album with \"Payphone,\" a single featuring Wiz Khalifa that hit number two. The resulting album, Overexposed, also reached number two, featuring production from a bevy of name producers including Ryan Tedder, Max Martin, Benny Blanco, and more. A second single from the album, the reggae-tinged \"One More Night,\" topped the charts not long after its release in June, and stayed at the top long enough to become the band's most successful showing to date. Two further singles also reached the Top Ten, \"Daylight\" and \"Love Somebody.\" During 2013, Levine continued to appear on The Voice, and also made appearances in the television drama American Horror Story, as well as the music-based dramatic film Begin Again. The band also hit the studio to record songs for a fifth studio album, aptly titled V, which saw keyboardist Jesse Carmichael return to the fold after a brief hiatus. Released in September 2014, V debuted at number one on the Billboard 200 chart and produced several Top Ten singles including \"Maps,\" \"Animals,\" and \"Sugar.\" Two more singles followed in 2015 with \"This Summer's Gonna Hurt Like a Motherf*****\" and \"Feelings.\" Also in 2015, Maroon 5 released their first hits collection, The Singles. The single \"Don't Wanna Know,\" featuring rapper Kendrick Lamar, appeared in 2016 and peaked at number nine on the Billboard Hot 100 chart. It was later revealed to be the first single from their forthcoming sixth LP. A second collaborative single, \"Cold,\" featuring Future, was released in early 2017, with \"What Lovers Do\" appearing before the November release of Red Pill Blues. ~ Andrew Leahey"},
{"artist": "Imagine Dragons", "artist_link": "https://itunes.apple.com/us/artist/imagine-dragons/id358714030?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is2-ssl.mzstatic.com/image/thumb/Features127/v4/c8/83/3e/c8833ee6-97d2-4a69-6701-292a4435be40/source/735x135sr.jpg", "origin": "Las Vegas, NV", "genre": "Alternative", "born": "2009", "latest_release": "Thunder (Official Remix) - Single", "intro": "A Grammy Award-winning alt-rock outfit with a knack for crafting stylish, stadium-ready anthems as emotionally charged as they are radio-friendly, Las Vegas-based Imagine Dragons had their genesis in Provo, Utah, where vocalist Dan Reynolds met drummer Andrew Tolman while the two attended Brigham Young University. In 2009, the group, which by this time included guitarist Daniel Wayne Sermon, bass player Ben McKee, and Tolman's wife Brittany Tolman on keys and backing vocals, had made a name for itself regionally and relocated to Reynolds' hometown of Las Vegas to record a pair of well-received EPs (Imagine Dragons and Hell and Silence) at the Killers' Battle Born Studios. A third EP, It's Time, arrived the following year and helped land the group a record deal with Interscope. The Tolmans parted ways with the group prior to the Interscope deal, and Daniel Platzman took over on drums.In 2012, Imagine Dragons hit it big with the Continued Silence EP and their debut long-player, Night Visions, the latter of which debuted at the number two spot on the Billboard 200 and landed the group multiple awards -- it later went double platinum in the U.S., largely on the smash success of \"Radioactive,\" which became the biggest-ever digital rock track in America. During 2013, two other hits followed: \"Demons\" in the U.S. and \"On Top of the World\" elsewhere. The group spent the bulk of 2014 finishing its second album. Co-produced by Alex da Kid, Smoke + Mirrors, the band's sophomore long-player, was released in February 2015 and debuted at number one, preceded by the singles \"I Bet My Life\" and \"Shots.\" The band toured often between June of 2015 and February of 2016, eventually releasing the concert set Smoke + Mirrors Live, recorded in 2015 at a sold-out Air Canada Centre in Toronto.Imagine Dragons took a well-deserved hiatus in 2016, making only a few sporadic forays into the studio to record three songs for soundtracks: \"Not Today\" for Me Before You, \"Sucker for Pain\" for Suicide Squad, and \"Levitate\" for Passengers. The group also recorded songs for their third proper album, releasing the lead single \"Believer\" in January 2017. The album, entitled Evolve, was released later that year; as the name suggests, it saw the band continuing to evolve, ditching almost entirely any remaining rock elements in their sound to fully embrace a heavily synthetic electro-pop-R&B style. ~ James Christopher Monger"},
{"artist": "Camila Cabello", "artist_link": "https://itunes.apple.com/us/artist/camila-cabello/id935727853?l=en&ign-mpt=uo%3D4", "artist_pic_link": "https://is1-ssl.mzstatic.com/image/thumb/Music19/v4/3b/90/32/3b9032f1-8f54-baff-e664-46c4b925d16f/source/146x146sr.jpg", "origin": "Cojimar, Cuba", "genre": "Pop", "born": "Mar 3, 1997", "latest_release": "Havana (feat. Young Thug) - Single", "intro": "Camila Cabello is a founding member of the girl group Fifth Harmony. Born Karla Camila Cabello Estrabao in Cojimar, Cuba, Cabello moved to Miami, Florida at the age of six. Growing up in a Spanish-speaking environment (her mother is Cuban and her father is Mexican), she fostered her love of music by listening to Celia Cruz and Alejandro Fernández. At the age of 15, she auditioned for The X Factor in Greensboro, North Carolina. Even though she was eliminated (along with her four future groupmates), the judges brought her back. Simon Cowell combined the girls into a quintet and formed Fifth Harmony. Despite finishing in third place, they went on to be the most successful contestants from that season. Their debut EP, Better Together, was released in October 2013, with acoustic reworkings, Spanish versions (Juntos and Juntos Acoustic), and a remix album following a month later. Their debut single, \"Miss Movin' On,\" was the highest-charting U.S. X Factor single at the time, a feat beaten only by each successive Fifth Harmony single. Their debut LP, Reflection, was released in early 2015, featuring the hits \"Sledgehammer\" (written by Meghan Trainor) and \"Worth It,\" featuring rapper Kid Ink. While backstage on Taylor Swift's 1989 world tour, Cabello wrote a duet with Canadian singer/songwriter Shawn Mendes. \"I Know What You Did Last Summer\" was released in November 2015 and immediately hit the Billboard Top 20. Fifth Harmony's sophomore set, 7/27, was issued in 2016, supported by a world tour and the hit single \"Work from Home.\" That same year, a duet with rapper Machine Gun Kelly, \"Bad Things,\" made its slow climb toward the top of the Billboard singles chart, garnering Cabello her first Top Ten song as a solo artist. Soon after, on December 18, Cabello announced her departure from Fifth Harmony. ~ Neil Z. Yeung"}
]